Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
/*! *********************************************************************************
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* Copyright 2016-2017 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_xcvr.h"
#include "fsl_xcvr_trim.h"
#include <math.h>
#include "ifr_radio.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define CAL_AT_FREQ_HZ  (2385000000UL)
#define channelMapTableSize (128U)
#define gPllDenom_c         0x02000000UL /* Denominator is a constant value */
#define ABS(x) ((x) > 0 ? (x) : -(x))

#ifndef TRUE
#define TRUE                    (true)
#endif

#ifndef FALSE
#define FALSE                   (false)
#endif
#define RF_OSCILLATOR_STAYS_ON     (false) /* Control whether RF_OSC can be left on all the time. */
#define RF_OSCILLATOR_READY        ((RSIM->CONTROL & RSIM_CONTROL_RF_OSC_READY_MASK) != 0x0UL)

#ifndef EXTERNAL_CLOCK_GEN
#define EXTERNAL_CLOCK_GEN   0
#endif

#define ANT_A   1
#define ANT_B   0

#ifndef XCVR_COEX_RF_ACTIVE_PIN
#define XCVR_COEX_RF_ACTIVE_PIN ANT_B
#endif /* XCVR_COEX_RF_ACTIVE_PIN */

typedef struct xcvr_pllChannel_tag
{
    unsigned int integer;
    unsigned int numerator;
} xcvr_pllChannel_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
#if RADIO_IS_GEN_3P0
static void rf_osc_startup(void);
static void rf_osc_shutdown(void);
#endif /* RADIO_IS_GEN_3P0 */
extern double trunc (double);
extern double round (double);

/*******************************************************************************
 * Variables
 ******************************************************************************/
static panic_fptr s_PanicFunctionPtr = NULL;
static const xcvr_pllChannel_t mapTable [channelMapTableSize] =
{
    {0x00000025UL, 0x07C00000UL}, /* 0 */
    {0x00000025UL, 0x07C80000UL}, /* 1 */
    {0x00000025UL, 0x07D00000UL}, /* 2 */
    {0x00000025UL, 0x07D80000UL}, /* 3 */
    {0x00000025UL, 0x07E00000UL}, /* 4 */
    {0x00000025UL, 0x07E80000UL}, /* 5 */
    {0x00000025UL, 0x07F00000UL}, /* 6 */
    {0x00000025UL, 0x07F80000UL}, /* 7 */
    {0x00000025UL, 0x00000000UL}, /* 8 */
    {0x00000025UL, 0x00080000UL}, /* 9 */
    {0x00000025UL, 0x00100000UL}, /* 10 */
    {0x00000025UL, 0x00180000UL}, /* 11 */
    {0x00000025UL, 0x00200000UL}, /* 12 */
    {0x00000025UL, 0x00280000UL}, /* 13 */
    {0x00000025UL, 0x00300000UL}, /* 14 */
    {0x00000025UL, 0x00380000UL}, /* 15 */
    {0x00000025UL, 0x00400000UL}, /* 16 */
    {0x00000025UL, 0x00480000UL}, /* 17 */
    {0x00000025UL, 0x00500000UL}, /* 18 */
    {0x00000025UL, 0x00580000UL}, /* 19 */
    {0x00000025UL, 0x00600000UL}, /* 20 */
    {0x00000025UL, 0x00680000UL}, /* 21 */
    {0x00000025UL, 0x00700000UL}, /* 22 */
    {0x00000025UL, 0x00780000UL}, /* 23 */
    {0x00000025UL, 0x00800000UL}, /* 24 */
    {0x00000025UL, 0x00880000UL}, /* 25 */
    {0x00000025UL, 0x00900000UL}, /* 26 */
    {0x00000025UL, 0x00980000UL}, /* 27 */
    {0x00000025UL, 0x00A00000UL}, /* 28 */
    {0x00000025UL, 0x00A80000UL}, /* 29 */
    {0x00000025UL, 0x00B00000UL}, /* 30 */
    {0x00000025UL, 0x00B80000UL}, /* 31 */
    {0x00000025UL, 0x00C00000UL}, /* 32 */
    {0x00000025UL, 0x00C80000UL}, /* 33 */
    {0x00000025UL, 0x00D00000UL}, /* 34 */
    {0x00000025UL, 0x00D80000UL}, /* 35 */
    {0x00000025UL, 0x00E00000UL}, /* 36 */
    {0x00000025UL, 0x00E80000UL}, /* 37 */
    {0x00000025UL, 0x00F00000UL}, /* 38 */
    {0x00000025UL, 0x00F80000UL}, /* 39 */
    {0x00000025UL, 0x01000000UL}, /* 40 */
    {0x00000026UL, 0x07080000UL}, /* 41 */
    {0x00000026UL, 0x07100000UL}, /* 42 */
    {0x00000026UL, 0x07180000UL}, /* 43 */
    {0x00000026UL, 0x07200000UL}, /* 44 */
    {0x00000026UL, 0x07280000UL}, /* 45 */
    {0x00000026UL, 0x07300000UL}, /* 46 */
    {0x00000026UL, 0x07380000UL}, /* 47 */
    {0x00000026UL, 0x07400000UL}, /* 48 */
    {0x00000026UL, 0x07480000UL}, /* 49 */
    {0x00000026UL, 0x07500000UL}, /* 50 */
    {0x00000026UL, 0x07580000UL}, /* 51 */
    {0x00000026UL, 0x07600000UL}, /* 52 */
    {0x00000026UL, 0x07680000UL}, /* 53 */
    {0x00000026UL, 0x07700000UL}, /* 54 */
    {0x00000026UL, 0x07780000UL}, /* 55 */
    {0x00000026UL, 0x07800000UL}, /* 56 */
    {0x00000026UL, 0x07880000UL}, /* 57 */
    {0x00000026UL, 0x07900000UL}, /* 58 */
    {0x00000026UL, 0x07980000UL}, /* 59 */
    {0x00000026UL, 0x07A00000UL}, /* 60 */
    {0x00000026UL, 0x07A80000UL}, /* 61 */
    {0x00000026UL, 0x07B00000UL}, /* 62 */
    {0x00000026UL, 0x07B80000UL}, /* 63 */
    {0x00000026UL, 0x07C00000UL}, /* 64 */
    {0x00000026UL, 0x07C80000UL}, /* 65 */
    {0x00000026UL, 0x07D00000UL}, /* 66 */
    {0x00000026UL, 0x07D80000UL}, /* 67 */
    {0x00000026UL, 0x07E00000UL}, /* 68 */
    {0x00000026UL, 0x07E80000UL}, /* 69 */
    {0x00000026UL, 0x07F00000UL}, /* 70 */
    {0x00000026UL, 0x07F80000UL}, /* 71 */
    {0x00000026UL, 0x00000000UL}, /* 72 */
    {0x00000026UL, 0x00080000UL}, /* 73 */
    {0x00000026UL, 0x00100000UL}, /* 74 */
    {0x00000026UL, 0x00180000UL}, /* 75 */
    {0x00000026UL, 0x00200000UL}, /* 76 */
    {0x00000026UL, 0x00280000UL}, /* 77 */
    {0x00000026UL, 0x00300000UL}, /* 78 */
    {0x00000026UL, 0x00380000UL}, /* 79 */
    {0x00000026UL, 0x00400000UL}, /* 80 */
    {0x00000026UL, 0x00480000UL}, /* 81 */
    {0x00000026UL, 0x00500000UL}, /* 82 */
    {0x00000026UL, 0x00580000UL}, /* 83 */
    {0x00000026UL, 0x00600000UL}, /* 84 */
    {0x00000026UL, 0x00680000UL}, /* 85 */
    {0x00000026UL, 0x00700000UL}, /* 86 */
    {0x00000026UL, 0x00780000UL}, /* 87 */
    {0x00000026UL, 0x00800000UL}, /* 88 */
    {0x00000026UL, 0x00880000UL}, /* 89 */
    {0x00000026UL, 0x00900000UL}, /* 90 */
    {0x00000026UL, 0x00980000UL}, /* 91 */
    {0x00000026UL, 0x00A00000UL}, /* 92 */
    {0x00000026UL, 0x00A80000UL}, /* 93 */
    {0x00000026UL, 0x00B00000UL}, /* 94 */
    {0x00000026UL, 0x00B80000UL}, /* 95 */
    {0x00000026UL, 0x00C00000UL}, /* 96 */
    {0x00000026UL, 0x00C80000UL}, /* 97 */
    {0x00000026UL, 0x00D00000UL}, /* 98 */
    {0x00000026UL, 0x00D80000UL}, /* 99 */
    {0x00000026UL, 0x00E00000UL}, /* 100 */
    {0x00000026UL, 0x00E80000UL}, /* 101 */
    {0x00000026UL, 0x00F00000UL}, /* 102 */
    {0x00000026UL, 0x00F80000UL}, /* 103 */
    {0x00000026UL, 0x01000000UL}, /* 104 */
    {0x00000027UL, 0x07080000UL}, /* 105 */
    {0x00000027UL, 0x07100000UL}, /* 106 */
    {0x00000027UL, 0x07180000UL}, /* 107 */
    {0x00000027UL, 0x07200000UL}, /* 108 */
    {0x00000027UL, 0x07280000UL}, /* 109 */
    {0x00000027UL, 0x07300000UL}, /* 110 */
    {0x00000027UL, 0x07380000UL}, /* 111 */
    {0x00000027UL, 0x07400000UL}, /* 112 */
    {0x00000027UL, 0x07480000UL}, /* 113 */
    {0x00000027UL, 0x07500000UL}, /* 114 */
    {0x00000027UL, 0x07580000UL}, /* 115 */
    {0x00000027UL, 0x07600000UL}, /* 116 */
    {0x00000027UL, 0x07680000UL}, /* 117 */
    {0x00000027UL, 0x07700000UL}, /* 118 */
    {0x00000027UL, 0x07780000UL}, /* 119 */
    {0x00000027UL, 0x07800000UL}, /* 120 */
    {0x00000027UL, 0x07880000UL}, /* 121 */
    {0x00000027UL, 0x07900000UL}, /* 122 */
    {0x00000027UL, 0x07980000UL}, /* 123 */
    {0x00000027UL, 0x07A00000UL}, /* 124 */
    {0x00000027UL, 0x07A80000UL}, /* 125 */
    {0x00000027UL, 0x07B00000UL}, /* 126 */
    {0x00000027UL, 0x07B80000UL}  /* 127 */
};

/* Registers for timing of TX & RX */
#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
uint16_t tx_rx_on_delay = (uint16_t)TX_RX_ON_DELinit;
uint16_t tx_rx_synth_delay = (uint16_t)TX_RX_SYNTH_init;
#else
#if RF_OSC_26MHZ == 1
uint16_t tx_rx_on_delay = (uint16_t)TX_RX_ON_DELAY_VAL_26MHZ;
#else
uint16_t tx_rx_on_delay = (uint16_t)TX_RX_ON_DELAY_VAL;
#endif /* RF_OSC_26MHZ == 1 */
uint16_t tx_rx_synth_delay = (uint16_t)TX_RX_SYNTH_DELAY_VAL;
#endif /* RADIO_IS_GEN_3P0 || RADIO_IS_2P1 */

/* NOTE: These arrays MUST be ordered in the same order as the radio_mode_t enumeration. */
#if RADIO_IS_GEN_3P0
static const xcvr_mode_datarate_config_t * mode_configs_dr_2mbps[NUM_RADIO_MODES]=
{
    (xcvr_mode_datarate_config_t *)NULL, /* 2Mbps rate not supported for this mode */
    (xcvr_mode_datarate_config_t *)NULL, /* 2Mbps rate not supported for this mode */
    (xcvr_mode_datarate_config_t *)NULL, /* 2Mbps rate not supported for this mode */
#if XCVR_GENFSK_ENABLED
    &xcvr_GFSK_BT_0p5_h_0p5_2mbps_config,
    &xcvr_GFSK_BT_0p5_h_0p32_2mbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_GENFSK_ENABLED */
    (xcvr_mode_datarate_config_t *)NULL, /* 2Mbps rate not supported for this mode */
    (xcvr_mode_datarate_config_t *)NULL, /* 2Mbps rate not supported for this mode */
#if XCVR_GENFSK_ENABLED
    &xcvr_GFSK_BT_0p3_h_0p5_2mbps_config,
    &xcvr_GFSK_BT_0p7_h_0p5_2mbps_config,
    &xcvr_MSK_2mbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_GENFSK_ENABLED */
};
#endif /* RADIO_IS_GEN_3P0 */

