Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
static const xcvr_mode_datarate_config_t * mode_configs_dr_1mbps[NUM_RADIO_MODES]=
{
#if XCVR_BLE_ENABLED
    &xcvr_BLE_1mbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_BLE_ENABLED */
#if RADIO_IS_GEN_2P1
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#else
#if XCVR_802_15_4_ENABLED
    &xcvr_ZIGBEE_250kbps_config, /* 802.15.4 only supports one configuration */
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_802_15_4_ENABLED */
#if XCVR_ANT_ENABLED
    &xcvr_ANT_1mbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_ANT_ENABLED */
#endif /* RADIO_IS_GEN_2P1 */
#if XCVR_GENFSK_ENABLED
    &xcvr_GFSK_BT_0p5_h_0p5_1mbps_config,
    &xcvr_GFSK_BT_0p5_h_0p32_1mbps_config,
    &xcvr_GFSK_BT_0p5_h_0p7_1mbps_config,
    &xcvr_GFSK_BT_0p5_h_1p0_1mbps_config,
    &xcvr_GFSK_BT_0p3_h_0p5_1mbps_config,
    &xcvr_GFSK_BT_0p7_h_0p5_1mbps_config,
    &xcvr_MSK_1mbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_GENFSK_ENABLED */

};

static const xcvr_mode_datarate_config_t * mode_configs_dr_500kbps[NUM_RADIO_MODES]=
{
    &xcvr_BLE_1mbps_config, /* Invalid option */
#if RADIO_IS_GEN_2P1
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#else
#if XCVR_802_15_4_ENABLED
    &xcvr_ZIGBEE_250kbps_config, /* 802.15.4 only supports one configuration */
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_802_15_4_ENABLED */
#if XCVR_ANT_ENABLED
    &xcvr_ANT_1mbps_config, /* Invalid option */
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_ANT_ENABLED */
#endif /* RADIO_IS_GEN_2P1 */
#if XCVR_GENFSK_ENABLED
    &xcvr_GFSK_BT_0p5_h_0p5_500kbps_config,
    &xcvr_GFSK_BT_0p5_h_0p32_500kbps_config,
    &xcvr_GFSK_BT_0p5_h_0p7_500kbps_config,
    &xcvr_GFSK_BT_0p5_h_1p0_500kbps_config,
    &xcvr_GFSK_BT_0p3_h_0p5_500kbps_config,
    &xcvr_GFSK_BT_0p7_h_0p5_500kbps_config,
    &xcvr_MSK_500kbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_GENFSK_ENABLED */
};
static const xcvr_mode_datarate_config_t * mode_configs_dr_250kbps[NUM_RADIO_MODES]=
{
    &xcvr_BLE_1mbps_config, /* Invalid option */
#if RADIO_IS_GEN_2P1
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#else
#if XCVR_802_15_4_ENABLED
    &xcvr_ZIGBEE_250kbps_config, /* 802.15.4 only supports one configuration */
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_802_15_4_ENABLED */
#if XCVR_ANT_ENABLED
    &xcvr_ANT_1mbps_config, /* Invalid option */
#else
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_ANT_ENABLED */
#endif /* RADIO_IS_GEN_2P1 */
#if XCVR_GENFSK_ENABLED
    &xcvr_GFSK_BT_0p5_h_0p5_250kbps_config,
    &xcvr_GFSK_BT_0p5_h_0p32_250kbps_config,
    &xcvr_GFSK_BT_0p5_h_0p7_250kbps_config,
    &xcvr_GFSK_BT_0p5_h_1p0_250kbps_config,
    &xcvr_GFSK_BT_0p3_h_0p5_250kbps_config,
    &xcvr_GFSK_BT_0p7_h_0p5_250kbps_config,
    &xcvr_MSK_250kbps_config,
#else
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
    (xcvr_mode_datarate_config_t *)NULL,
#endif /* XCVR_GENFSK_ENABLED */
};

static xcvr_currConfig_t current_xcvr_config;

#if RADIO_IS_GEN_3P0
static void rf_osc_startup(void)
{
    if (!RF_OSCILLATOR_READY)
    {
        RSIM->CONTROL |= RSIM_CONTROL_RF_OSC_EN_MASK;
    }
    while (!RF_OSCILLATOR_READY)
    {
        /* Wait for RF_OSC_READY to be asserted before continuing */
    }
}

static void rf_osc_shutdown(void)
{
    /* RF_OSCILLATOR_STAYS_ON flag controls whether XCVR can shut off RF OSC or not */
#if (!RF_OSCILLATOR_STAYS_ON)
        RSIM->CONTROL &= ~RSIM_CONTROL_RF_OSC_EN_MASK;
#endif /* (!RF_OSCILLATOR_STAYS_ON) */
}
#endif /* RADIO_IS_GEN_3P0 */

/*******************************************************************************
 * Code
 *******************************************************************************/
xcvrStatus_t XCVR_Init(radio_mode_t radio_mode, data_rate_t data_rate)
{
    const xcvr_mode_datarate_config_t * mode_datarate_config;
    const xcvr_datarate_config_t * datarate_config ;
    const xcvr_mode_config_t * radio_mode_cfg;
    const xcvr_common_config_t * radio_common_config;
    
    xcvrStatus_t status;

    /* Startup the radio (power mode) and turn on required clocks */
    status = XCVR_RadioStartup();
    
    /* Perform the desired XCVR initialization and configuration */
    if (status == gXcvrSuccess_c)
    {
        status = XCVR_GetDefaultConfig(radio_mode, data_rate, 
                                   (const xcvr_common_config_t **)&radio_common_config, 
                                   (const xcvr_mode_config_t **)&radio_mode_cfg, 
                                   (const xcvr_mode_datarate_config_t **)&mode_datarate_config, 
                                   (const xcvr_datarate_config_t **)&datarate_config );
    }
    
    if (status == gXcvrSuccess_c)
    {
        status = XCVR_Configure((const xcvr_common_config_t *)radio_common_config, 
                                (const xcvr_mode_config_t *)radio_mode_cfg, 
                                (const xcvr_mode_datarate_config_t *)mode_datarate_config, 
                                (const xcvr_datarate_config_t *)datarate_config, XCVR_FIRST_INIT);
        current_xcvr_config.radio_mode = radio_mode;
        current_xcvr_config.data_rate = datarate_config->data_rate;
    }
    return status;
}

