Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
xcvrStatus_t XCVR_InitNoDacTrim(radio_mode_t radio_mode, data_rate_t data_rate)
{
    const xcvr_mode_datarate_config_t * mode_datarate_config;
    const xcvr_datarate_config_t * datarate_config ;
    const xcvr_mode_config_t * radio_mode_cfg;
    const xcvr_common_config_t * radio_common_config;
    
    xcvrStatus_t status;

    /* Startup the radio (power mode) and turn on required clocks */
    status = XCVR_RadioStartup();
    
    /* Perform the desired XCVR initialization and configuration */
    if (status == gXcvrSuccess_c)
    {
        status = XCVR_GetDefaultConfig(radio_mode, data_rate, 
                                   (const xcvr_common_config_t **)&radio_common_config, 
                                   (const xcvr_mode_config_t **)&radio_mode_cfg, 
                                   (const xcvr_mode_datarate_config_t **)&mode_datarate_config, 
                                   (const xcvr_datarate_config_t **)&datarate_config );
    }
    
    if (status == gXcvrSuccess_c)
    {
        status = XCVR_RadioRegSetup((const xcvr_common_config_t *)radio_common_config, 
                                (const xcvr_mode_config_t *)radio_mode_cfg, 
                                (const xcvr_mode_datarate_config_t *)mode_datarate_config, 
                                (const xcvr_datarate_config_t *)datarate_config, XCVR_FIRST_INIT);
        /* normally DCOC DAC trim would go here */
        current_xcvr_config.radio_mode = radio_mode;
        current_xcvr_config.data_rate = datarate_config->data_rate;
    }
    return status;
}

void XCVR_Deinit(void)
{
#if RADIO_IS_GEN_3P0
    rf_osc_shutdown();
    RSIM->POWER |= RSIM_POWER_RSIM_STOP_MODE_MASK; /* Set radio stop mode to RVLLS */
    RSIM->POWER &= ~RSIM_POWER_RSIM_RUN_REQUEST_MASK; /* Clear RUN request */
#else
#endif /* RADIO_IS_GEN_3P0 */
}

xcvrStatus_t XCVR_RadioStartup(void)
{
    xcvrStatus_t status = gXcvrSuccess_c;
#if !RADIO_IS_GEN_3P0 /* SW trim table is not used in Gen3 radio */
    IFR_SW_TRIM_TBL_ENTRY_T sw_trim_tbl[] =
    {
        {TRIM_STATUS, 0, FALSE}, /*!< Fetch the trim status word if available.*/
        {TRIM_VERSION, 0, FALSE} /*!< Fetch the trim version number if available.*/
    };
    const uint8_t NUM_TRIM_TBL_ENTRIES = sizeof(sw_trim_tbl)/sizeof(IFR_SW_TRIM_TBL_ENTRY_T);
#endif /* !RADIO_IS_GEN_3P0 */

#if (EXTERNAL_CLOCK_GEN)
    RSIM->RF_OSC_CTRL |= RSIM_RF_OSC_CTRL_RF_OSC_BYPASS_EN_MASK; /* Only when external clock is being used */
#endif /* EXTERNAL_CLOCK_GEN */

#if RADIO_IS_GEN_2P0
    RSIM->RF_OSC_CTRL &= ~RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_MASK; /* Set EXT_OSC_OVRD value to zero */
    RSIM->RF_OSC_CTRL |= RSIM_RF_OSC_CTRL_RADIO_EXT_OSC_OVRD_EN_MASK; /* Enable over-ride with zero value */   
#endif /* RADIO_IS_GEN_2P0 */

#if RADIO_IS_GEN_3P0
    /* Assert Radio Run Request and wait for ack from SPM. */
    RSIM->POWER |= RSIM_POWER_RSIM_RUN_REQUEST_MASK;
    while ((RSIM->POWER & RSIM_POWER_SPM_RUN_ACK_STAT_MASK) == 0UL)
    {
    }
    RSIM->CONTROL |= RSIM_CONTROL_RSIM_CGC_XCVR_EN_MASK; 
    rf_osc_startup(); /* Start RF_OSC to allow radio registers access */
#else
    SIM->SCGC5 |= SIM_SCGC5_PHYDIG_MASK;

    /* Load IFR trim values */
    handle_ifr(&sw_trim_tbl[0], NUM_TRIM_TBL_ENTRIES);
#endif /* RADIO_IS_GEN_3P0 */

    /* Check that this is the proper radio version */
    {
#if (0)
    uint8_t radio_id = (uint8_t)((RSIM->MISC & RSIM_MISC_RADIO_VERSION_MASK)>>RSIM_MISC_RADIO_VERSION_SHIFT);
#else
    /* Make sure a 32 bit read is made otherwise when optimizations are enabled some compilers */
    /*    may generate code which makes a 8 bit read which will cause a hard fault. */
    uint8_t radio_id = (*((volatile uint32_t*)(RSIM_BASE+0x10)) & 0xFF000000U)>>24;
#endif
        if (
#if RADIO_IS_GEN_3P0
            ((radio_id != 0x4U) /* KW3 Gen3, A1 */
            && (radio_id != 0x5U) /* KW3 Gen3, A2 */
            && (radio_id != 0x0U))       /* KW3 Gen3 reads zero at this time */
#elif RADIO_IS_GEN_2P1
            ((radio_id != 0x8U) /* KW35 Gen2.1 A0 */
            && (radio_id != 0xAU)) /* KW35 Gen2.1 A1 */
#else
            (radio_id != 0x3U) &&  /* KW41/31/21 v1 */
            (radio_id != 0xBU) /* KW41/31/21 v1.1 */
#endif /* RADIO_IS_GEN_3P0 */
            )
        {
            XcvrPanic(WRONG_RADIO_ID_DETECTED,(uint32_t)&XCVR_Init);
        }
    }

    return status;
}

xcvrStatus_t XCVR_GetDefaultConfig(radio_mode_t radio_mode, 
                                   data_rate_t data_rate, 
                                   const xcvr_common_config_t ** com_config, 
                                   const xcvr_mode_config_t ** mode_config, 
                                   const xcvr_mode_datarate_config_t ** mode_datarate_config, 
                                   const xcvr_datarate_config_t ** datarate_config)
{
    xcvrStatus_t status = gXcvrSuccess_c;
    /* Common configuration pointer */
    *com_config = (const xcvr_common_config_t *)&xcvr_common_config;

    /* Mode dependent configuration pointer */
    switch (radio_mode)
    {
#if !RADIO_IS_GEN_2P1
#if XCVR_802_15_4_ENABLED
        case ZIGBEE_MODE:
            *mode_config = ( const xcvr_mode_config_t *)&zgbe_mode_config;    /* Zigbee configuration */
            break;
#endif /* XCVR_802_15_4_ENABLED */
#if XCVR_ANT_ENABLED
        case ANT_MODE:
            *mode_config = ( const xcvr_mode_config_t *)&ant_mode_config;     /* ANT configuration */
            break;
#endif /* XCVR_ANT_ENABLED */
#endif /* !RADIO_IS_GEN_2P1 */
#if XCVR_BLE_ENABLED
        case BLE_MODE:
            *mode_config = ( const xcvr_mode_config_t *)&ble_mode_config;     /* BLE configuration */
            break;
#endif /* XCVR_BLE_ENABLED */
#if XCVR_GENFSK_ENABLED
        case GFSK_BT_0p5_h_0p5:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p5_h_0p5_mode_config;     /* GFSK_BT_0p5_h_0p5 configuration */
            break;
        case GFSK_BT_0p5_h_0p32:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p5_h_0p32_mode_config;     /* GFSK_BT_0p5_h_0p32 configuration */
            break;
        case GFSK_BT_0p5_h_0p7:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p5_h_0p7_mode_config;     /* GFSK_BT_0p5_h_0p7 configuration */
            break;
        case GFSK_BT_0p5_h_1p0:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p5_h_1p0_mode_config;     /* GFSK_BT_0p5_h_1p0 configuration */
            break;
        case GFSK_BT_0p3_h_0p5:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p3_h_0p5_mode_config;     /* GFSK_BT_0p3_h_0p5 configuration */
            break;
        case GFSK_BT_0p7_h_0p5:
            *mode_config = ( const xcvr_mode_config_t *)&gfsk_bt_0p7_h_0p5_mode_config;     /* GFSK_BT_0p7_h_0p5 configuration */
            break;
        case MSK:
            *mode_config = ( const xcvr_mode_config_t *)&msk_mode_config;     /* MSK configuration */
            break;
#endif /* XCVR_GENFSK_ENABLED */

        default:    
            status = gXcvrInvalidParameters_c;
            break;
    }

    /* Data rate dependent and modeXdatarate dependent configuration pointers */
    if (status == gXcvrSuccess_c) /* Only attempt this pointer assignment process if prior switch() statement completed successfully */
    {
        if (radio_mode == ZIGBEE_MODE)
        {
            /* See fsl_xcvr_zgbe_config.c for settings */
#if !RADIO_IS_GEN_2P1 && XCVR_802_15_4_ENABLED
            *mode_datarate_config = (const xcvr_mode_datarate_config_t *)&xcvr_ZIGBEE_250kbps_config; /* 802.15.4 setting */
            *datarate_config = (const xcvr_datarate_config_t *)&xcvr_802_15_4_250kbps_config; /* 500Kbps datarate configurations */
#else
            status = gXcvrInvalidParameters_c;
#endif /* !RADIO_IS_GEN_2P1 */
        }
        else
        {
            switch (data_rate)
            {
#if RADIO_IS_GEN_3P0
                case DR_2MBPS:
                    if ((radio_mode == GFSK_BT_0p5_h_0p7) || (radio_mode == GFSK_BT_0p5_h_1p0) || (radio_mode == BLE_MODE) || (radio_mode == ANT_MODE))
                    {
                        status = gXcvrInvalidParameters_c;
                    }
                    else
                    {
                        *datarate_config = (const xcvr_datarate_config_t *)&xcvr_2mbps_config; /* 2Mbps datarate configurations */
                        *mode_datarate_config = (const xcvr_mode_datarate_config_t *)mode_configs_dr_2mbps[radio_mode];
                    }
                    break;
#endif /* RADIO_IS_GEN_3P0 */
                case DR_1MBPS:
                    *datarate_config = (const xcvr_datarate_config_t *)&xcvr_1mbps_config; /* 1Mbps datarate configurations */
                    *mode_datarate_config = (const xcvr_mode_datarate_config_t *)mode_configs_dr_1mbps[radio_mode];
                    break;
                case DR_500KBPS:
                    *datarate_config = (const xcvr_datarate_config_t *)&xcvr_500kbps_config; /* 500Kbps datarate configurations */
                    *mode_datarate_config = (const xcvr_mode_datarate_config_t *)mode_configs_dr_500kbps[radio_mode];
                    break;
                case DR_250KBPS:
                    *datarate_config = (const xcvr_datarate_config_t *)&xcvr_250kbps_config; /* 250Kbps datarate configurations */
                    *mode_datarate_config = (const xcvr_mode_datarate_config_t *)mode_configs_dr_250kbps[radio_mode];
                    break;
                default:
                    status = gXcvrInvalidParameters_c;
                    break;
            }
        }
    }
    return status;
}

xcvrStatus_t XCVR_Configure(const xcvr_common_config_t *com_config, 
                            const xcvr_mode_config_t *mode_config, 
                            const xcvr_mode_datarate_config_t *mode_datarate_config, 
                            const xcvr_datarate_config_t *datarate_config, 
                            XCVR_INIT_MODE_CHG_T first_init)
{
    xcvr_DcocDacTrim_t dac_trims;
    xcvrStatus_t config_status = gXcvrSuccess_c;

    config_status =  XCVR_RadioRegSetup(com_config, mode_config, mode_datarate_config, datarate_config, first_init);
    
    if ((first_init) && (config_status == gXcvrSuccess_c))
    {
        config_status = XCVR_CalculateDcocDacTrims(&dac_trims);
    }

