Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
    return config_status;
}


xcvrStatus_t XCVR_RadioRegSetup(const xcvr_common_config_t *com_config, 
                            const xcvr_mode_config_t *mode_config, 
                            const xcvr_mode_datarate_config_t *mode_datarate_config, 
                            const xcvr_datarate_config_t *datarate_config, 
                            XCVR_INIT_MODE_CHG_T first_init)

{
    xcvrStatus_t config_status = gXcvrSuccess_c;
    uint32_t temp; 

    if ((com_config == NULL) || (mode_config == NULL) || (mode_datarate_config == NULL) || (datarate_config == NULL))
    {
        config_status = gXcvrInvalidParameters_c;
    }
    else
    {
        /* Turn on the module clocks before doing anything */
#if RADIO_IS_GEN_3P0
        RSIM->CONTROL |= mode_config->scgc5_clock_ena_bits; /* Same bit storage is used but RSIM bit assignments are applied */
#else
        SIM->SCGC5 |= mode_config->scgc5_clock_ena_bits;
#endif /* RADIO_IS_GEN_3P0 */
        
        /*******************************************************************************/
        /* XCVR_ANA configs */
        /*******************************************************************************/
        /* Configure PLL Loop Filter */
        if (first_init)
        {
            XCVR_ANA->SY_CTRL_1 &= ~com_config->ana_sy_ctrl1.mask;
            XCVR_ANA->SY_CTRL_1 |= com_config->ana_sy_ctrl1.init;
        }

        /* Configure VCO KVM */
        XCVR_ANA->SY_CTRL_2 &= ~mode_datarate_config->ana_sy_ctrl2.mask;
        XCVR_ANA->SY_CTRL_2 |= mode_datarate_config->ana_sy_ctrl2.init;

        /* Configure analog filter bandwidth */
        XCVR_ANA->RX_BBA &= ~mode_datarate_config->ana_rx_bba.mask;
        XCVR_ANA->RX_BBA |= mode_datarate_config->ana_rx_bba.init;
        XCVR_ANA->RX_TZA &= ~mode_datarate_config->ana_rx_tza.mask;
        XCVR_ANA->RX_TZA |= mode_datarate_config->ana_rx_tza.init;

        if (first_init)
        {
#if RADIO_IS_GEN_2P0 /* Analog bump settings specific to Gen 2.0 (KW41) */
            temp = XCVR_ANA->TX_DAC_PA;
            temp &= ~XCVR_ANALOG_TX_DAC_PA_TX_PA_BUMP_VBIAS_MASK;
            temp |= XCVR_ANALOG_TX_DAC_PA_TX_PA_BUMP_VBIAS(4);
            XCVR_ANA->TX_DAC_PA = temp;

            temp = XCVR_ANA->BB_LDO_2;
            temp &= ~XCVR_ANALOG_BB_LDO_2_BB_LDO_VCOLO_TRIM_MASK;
            temp |= XCVR_ANALOG_BB_LDO_2_BB_LDO_VCOLO_TRIM(0);
            XCVR_ANA->BB_LDO_2 = temp;

            temp = XCVR_ANA->RX_LNA;
            temp &= ~XCVR_ANALOG_RX_LNA_RX_LNA_BUMP_MASK;
            temp |= XCVR_ANALOG_RX_LNA_RX_LNA_BUMP(1);
            XCVR_ANA->RX_LNA = temp;

            temp = XCVR_ANA->BB_LDO_1;
            temp &= ~XCVR_ANALOG_BB_LDO_1_BB_LDO_FDBK_TRIM_MASK;
            temp |= XCVR_ANALOG_BB_LDO_1_BB_LDO_FDBK_TRIM(1);
            XCVR_ANA->BB_LDO_1 = temp;
#else /* Analog bump settings (different fields!!!) specific to Gen 2.1 & Gen 3.0 analog */
            /* Note: this code is ONLY for setting the bits, it must be rewritten in order to clear any bits */
            XCVR_ANA->RX_LNA |= XCVR_ANALOG_RX_LNA_RX_LNA_SPARE(0x1UL); /* set Lsbit only */
            XCVR_ANA->TX_DAC_PA |= XCVR_ANALOG_TX_DAC_PA_TX_PA_SPARE(0x1UL);  /* set Lsbit only */
            XCVR_ANA->RX_AUXPLL |= XCVR_ANALOG_RX_AUXPLL_SPARE(0x1UL);  /* set Lsbit only */
            temp = XCVR_ANA->BB_LDO_2;
            temp &= XCVR_ANALOG_BB_LDO_2_BB_LDO_VTREF_TC_MASK; /* clear both bits in the field*/
            temp |= XCVR_ANALOG_BB_LDO_2_BB_LDO_VTREF_TC(0x1UL); /* then set the Lsbit */
            XCVR_ANA->BB_LDO_2 = temp;
#endif /* RADIO_IS_GEN_2P0 */
        }

        /*******************************************************************************/
        /* XCVR_MISC configs */
        /*******************************************************************************/
        temp = XCVR_MISC->XCVR_CTRL;
        temp &= ~(mode_config->xcvr_ctrl.mask | XCVR_CTRL_XCVR_CTRL_REF_CLK_FREQ_MASK);
        temp |= mode_config->xcvr_ctrl.init;
#if RF_OSC_26MHZ == 1
        {
            temp |= XCVR_CTRL_XCVR_CTRL_REF_CLK_FREQ(1UL);
        }
#endif /* RF_OSC_26MHZ == 1 */
        XCVR_MISC->XCVR_CTRL = temp;

#if RADIO_IS_GEN_2P1
        XCVR_MISC->FAD_CTRL &= ~XCVR_CTRL_FAD_CTRL_FAD_NOT_GPIO_MASK;
#endif /* RADIO_IS_GEN_2P1 */
        /*******************************************************************************/
        /* XCVR_PHY configs */
        /*******************************************************************************/
#if RADIO_IS_GEN_3P0
        XCVR_PHY->PHY_FSK_PD_CFG0 = mode_config->phy_fsk_pd_cfg0;
#if RF_OSC_26MHZ == 1
        XCVR_PHY->PHY_FSK_PD_CFG1 = mode_config->phy_fsk_pd_cfg1 | mode_datarate_config->phy_fsk_pd_cfg1_mode_datarate_26mhz;
        XCVR_PHY->PHY_FSK_CFG = mode_config->phy_fsk_cfg | mode_datarate_config->phy_fsk_cfg_mode_datarate_26mhz;
#else /* RF_OSC_26MHZ == 1 */
        XCVR_PHY->PHY_FSK_PD_CFG1 = mode_config->phy_fsk_pd_cfg1 | mode_datarate_config->phy_fsk_pd_cfg1_mode_datarate_32mhz;
        XCVR_PHY->PHY_FSK_CFG = mode_config->phy_fsk_cfg | mode_datarate_config->phy_fsk_cfg_mode_datarate_32mhz;
#endif /* RF_OSC_26MHZ == 1 */

#if (0) /* error in PHY header definitions! */
#if RF_OSC_26MHZ == 1
        XCVR_PHY->PHY_FSK_MISC = mode_config->phy_fsk_misc | mode_datarate_config->phy_fsk_misc_mode_datarate_26mhz; /* Need to combine mode specific and mode/datarate specific settings */
#else
        XCVR_PHY->PHY_FSK_MISC = mode_config->phy_fsk_misc | mode_datarate_config->phy_fsk_misc_mode_datarate_32mhz; /* Need to combine mode specific and mode/datarate specific settings */
#endif /* RF_OSC_26MHZ == 1 */
        XCVR_PHY->FSK_FAD_CTRL = mode_config->phy_fad_ctrl;
#else /* error in PHY header definitions! */
#if RF_OSC_26MHZ == 1
        *(uint32_t *)(XCVR_PHY_BASE+0xCUL) = mode_config->phy_fsk_misc | mode_datarate_config->phy_fsk_misc_mode_datarate_26mhz; /* Need to combine mode specific and mode/datarate specific settings */
#else
        *(uint32_t *)(XCVR_PHY_BASE+0xCUL) = mode_config->phy_fsk_misc | mode_datarate_config->phy_fsk_misc_mode_datarate_32mhz; /* Need to combine mode specific and mode/datarate specific settings */
#endif /* RF_OSC_26MHZ == 1 */
        *(uint32_t *)(XCVR_PHY_BASE+0x18UL) = mode_config->phy_fad_ctrl;
#endif /* error in PHY header definitions! */

#else /* RADIO_IS_GEN_3P0 */
        XCVR_PHY->PHY_PRE_REF0 = mode_config->phy_pre_ref0_init;
        XCVR_PHY->PRE_REF1 = mode_config->phy_pre_ref1_init;
        XCVR_PHY->PRE_REF2 = mode_config->phy_pre_ref2_init;
        XCVR_PHY->CFG1 = mode_config->phy_cfg1_init;
        XCVR_PHY->CFG2 = mode_datarate_config->phy_cfg2_init;
        XCVR_PHY->EL_CFG = mode_config->phy_el_cfg_init | datarate_config->phy_el_cfg_init; /* EL_WIN_SIZE and EL_INTERVAL are datarate dependent, */
#endif /* RADIO_IS_GEN_3P0 */

