Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
        /*******************************************************************************/
        /* XCVR_PLL_DIG configs */
        /*******************************************************************************/
        if (first_init)
        {
            XCVR_PLL_DIG->HPM_BUMP  = com_config->pll_hpm_bump;
            XCVR_PLL_DIG->MOD_CTRL  = com_config->pll_mod_ctrl;
            XCVR_PLL_DIG->CHAN_MAP  = com_config->pll_chan_map;
            XCVR_PLL_DIG->LOCK_DETECT  = com_config->pll_lock_detect;
            XCVR_PLL_DIG->HPM_CTRL  = com_config->pll_hpm_ctrl;
#if ((!RADIO_IS_GEN_2P1) && (!RADIO_IS_GEN_3P0))
            XCVR_PLL_DIG->HPMCAL_CTRL  = com_config->pll_hpmcal_ctrl;
#endif /* ((!RADIO_IS_GEN_2P1) && (!RADIO_IS_GEN_3P0)) */
            XCVR_PLL_DIG->HPM_SDM_RES  = com_config->pll_hpm_sdm_res;
            XCVR_PLL_DIG->LPM_CTRL  = com_config->pll_lpm_ctrl;
            XCVR_PLL_DIG->LPM_SDM_CTRL1  = com_config->pll_lpm_sdm_ctrl1;
            XCVR_PLL_DIG->DELAY_MATCH  = com_config->pll_delay_match;
            XCVR_PLL_DIG->CTUNE_CTRL  = com_config->pll_ctune_ctrl;
        }

        /*******************************************************************************/
        /* XCVR_RX_DIG configs */
        /*******************************************************************************/
        /* Configure RF Aux PLL for proper operation based on external clock frequency */
        if (first_init)
        {
            temp = XCVR_ANA->RX_AUXPLL;
            temp &= ~XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST_MASK;
#if RF_OSC_26MHZ == 1
            temp |= XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST(4UL);
#else
            temp |= XCVR_ANALOG_RX_AUXPLL_VCO_DAC_REF_ADJUST(7UL);
#endif /* RF_OSC_26MHZ == 1 */
            XCVR_ANA->RX_AUXPLL = temp;
        }
        
        /* Configure RX_DIG_CTRL */
#if RF_OSC_26MHZ == 1
        {
            temp = com_config->rx_dig_ctrl_init | /* Common portion of RX_DIG_CTRL init */
                   mode_config->rx_dig_ctrl_init_26mhz | /* Mode  specific portion of RX_DIG_CTRL init */
                   datarate_config->rx_dig_ctrl_init_26mhz | /* Datarate specific portion of RX_DIG_CTRL init */
                XCVR_RX_DIG_RX_DIG_CTRL_RX_SRC_EN_MASK; /* Always enable the sample rate converter for 26MHz */
        }
#else
        {
            temp = com_config->rx_dig_ctrl_init | /* Common portion of RX_DIG_CTRL init */
                   mode_config->rx_dig_ctrl_init_32mhz | /* Mode specific portion of RX_DIG_CTRL init */
                   datarate_config->rx_dig_ctrl_init_32mhz | /* Datarate specific portion of RX_DIG_CTRL init */
                0UL; /* Always disable the sample rate converter for 32MHz */
        }
#endif /* RF_OSC_26MHZ == 1 */

        temp |= com_config->rx_dig_ctrl_init;  /* Common portion of RX_DIG_CTRL init */
        XCVR_RX_DIG->RX_DIG_CTRL = temp;

        /* DCOC_CAL_IIR */
#if RADIO_IS_GEN_3P0
#if RF_OSC_26MHZ == 1
        {
            XCVR_RX_DIG->DCOC_CAL_IIR = mode_datarate_config->dcoc_cal_iir_init_26mhz;
        }
#else
        {
            XCVR_RX_DIG->DCOC_CAL_IIR = mode_datarate_config->dcoc_cal_iir_init_32mhz;
        }
#endif /* RF_OSC_26MHZ == 1 */
#else
#if RF_OSC_26MHZ == 1
        {
            XCVR_RX_DIG->DCOC_CAL_IIR = datarate_config->dcoc_cal_iir_init_26mhz;
        }
#else
        {
            XCVR_RX_DIG->DCOC_CAL_IIR = datarate_config->dcoc_cal_iir_init_32mhz;
        }
#endif /* RF_OSC_26MHZ == 1 */
#endif /* RADIO_IS_GEN_3P0 */

        /* DC_RESID_CTRL */
#if RF_OSC_26MHZ == 1
        {
#if RADIO_IS_GEN_3P0
        XCVR_RX_DIG->DC_RESID_CTRL = mode_config->dc_resid_ctrl_init | mode_datarate_config->dc_resid_ctrl_init | datarate_config->dc_resid_ctrl_26mhz;
#else
#if RADIO_IS_GEN_2P0
        XCVR_RX_DIG->DC_RESID_CTRL = com_config->dc_resid_ctrl_init | datarate_config->dc_resid_ctrl_26mhz;
#else /* GEN 2.1 */
        XCVR_RX_DIG->DC_RESID_CTRL = com_config->dc_resid_ctrl_init | mode_datarate_config->dc_resid_ctrl_init_26mhz | datarate_config->dc_resid_ctrl_26mhz;
#endif /* RADIO_IS_GEN_2P0 */
#endif /* RADIO_IS_GEN_3P0 */
        }
#else /* 32MHz */
        {
#if RADIO_IS_GEN_3P0
        XCVR_RX_DIG->DC_RESID_CTRL = mode_config->dc_resid_ctrl_init | mode_datarate_config->dc_resid_ctrl_init | datarate_config->dc_resid_ctrl_32mhz;
#else
#if RADIO_IS_GEN_2P0
        XCVR_RX_DIG->DC_RESID_CTRL = com_config->dc_resid_ctrl_init | datarate_config->dc_resid_ctrl_32mhz;
#else /* GEN 2.1 */
        XCVR_RX_DIG->DC_RESID_CTRL = com_config->dc_resid_ctrl_init | mode_datarate_config->dc_resid_ctrl_init_32mhz | datarate_config->dc_resid_ctrl_32mhz;
#endif /* RADIO_IS_GEN_2P0 */
#endif /* RADIO_IS_GEN_3P0 */
        }
#endif /* RF_OSC_26MHZ == 1 */

        /* DCOC_CTRL_0  & _1 */
#if RF_OSC_26MHZ == 1
        {

#if RADIO_IS_GEN_2P1
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_26mhz | mode_datarate_config->dcoc_ctrl_0_init_26mhz | datarate_config->dcoc_ctrl_0_init_26mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init | mode_datarate_config->dcoc_ctrl_1_init_26mhz | datarate_config->dcoc_ctrl_1_init_26mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_2P1 */
#if RADIO_IS_GEN_2P0
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_26mhz | datarate_config->dcoc_ctrl_0_init_26mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init | datarate_config->dcoc_ctrl_1_init_26mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_2P0 */
#if RADIO_IS_GEN_3P0
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_26mhz | mode_datarate_config->dcoc_ctrl_0_init_26mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init |  mode_datarate_config->dcoc_ctrl_1_init | datarate_config->dcoc_ctrl_1_init_26mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_2 = datarate_config->dcoc_ctrl_2_init_26mhz;
#endif /* RADIO_IS_GEN_3P0 */
        }
#else
        {
#if RADIO_IS_GEN_2P1
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_32mhz | mode_datarate_config->dcoc_ctrl_0_init_32mhz | datarate_config->dcoc_ctrl_0_init_32mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init | mode_datarate_config->dcoc_ctrl_1_init_32mhz | datarate_config->dcoc_ctrl_1_init_32mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_2P1 */
#if RADIO_IS_GEN_2P0
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_32mhz | datarate_config->dcoc_ctrl_0_init_32mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init | datarate_config->dcoc_ctrl_1_init_32mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_2P0 */
#if RADIO_IS_GEN_3P0
            XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_32mhz | mode_datarate_config->dcoc_ctrl_0_init_32mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_1 = com_config->dcoc_ctrl_1_init | mode_datarate_config->dcoc_ctrl_1_init | datarate_config->dcoc_ctrl_1_init_32mhz; /* Combine common and datarate specific settings */
            XCVR_RX_DIG->DCOC_CTRL_2 = datarate_config->dcoc_ctrl_2_init_32mhz;
#endif /* RADIO_IS_GEN_3P0 */
        }
#endif /* RF_OSC_26MHZ == 1 */

