Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
#if RADIO_IS_GEN_3P0
        /* DCOC_CAL_GAIN */
        XCVR_RX_DIG->DCOC_CAL_GAIN = com_config->dcoc_cal_gain_init | mode_datarate_config->dcoc_cal_gain_init;

        /* DCOC_CAL_RCP */
        XCVR_RX_DIG->DCOC_CAL_RCP = com_config->dcoc_cal_rcp_init | mode_datarate_config->dcoc_cal_rcp_init;
#else
        /* DCOC_CAL_GAIN */
        XCVR_RX_DIG->DCOC_CAL_GAIN = com_config->dcoc_cal_gain_init;

        /* DCOC_CAL_RCP */
        XCVR_RX_DIG->DCOC_CAL_RCP = com_config->dcoc_cal_rcp_init;
#endif /* RADIO_IS_GEN_3P0 */

        if (first_init)
        {

            XCVR_RX_DIG->LNA_GAIN_VAL_3_0 = com_config->lna_gain_val_3_0;
            XCVR_RX_DIG->LNA_GAIN_VAL_7_4 = com_config->lna_gain_val_7_4;
            XCVR_RX_DIG->LNA_GAIN_VAL_8 = com_config->lna_gain_val_8;
            XCVR_RX_DIG->BBA_RES_TUNE_VAL_7_0 = com_config->bba_res_tune_val_7_0;
            XCVR_RX_DIG->BBA_RES_TUNE_VAL_10_8 = com_config->bba_res_tune_val_10_8;

            /* LNA_GAIN_LIN_VAL */
            XCVR_RX_DIG->LNA_GAIN_LIN_VAL_2_0 = com_config->lna_gain_lin_val_2_0_init;
            XCVR_RX_DIG->LNA_GAIN_LIN_VAL_5_3 = com_config->lna_gain_lin_val_5_3_init;
            XCVR_RX_DIG->LNA_GAIN_LIN_VAL_8_6 = com_config->lna_gain_lin_val_8_6_init;
            XCVR_RX_DIG->LNA_GAIN_LIN_VAL_9 = com_config->lna_gain_lin_val_9_init;

            /* BBA_RES_TUNE_LIN_VAL */
            XCVR_RX_DIG->BBA_RES_TUNE_LIN_VAL_3_0 = com_config->bba_res_tune_lin_val_3_0_init;
            XCVR_RX_DIG->BBA_RES_TUNE_LIN_VAL_7_4 = com_config->bba_res_tune_lin_val_7_4_init;
            XCVR_RX_DIG->BBA_RES_TUNE_LIN_VAL_10_8 = com_config->bba_res_tune_lin_val_10_8_init;

            /* BBA_STEP */
            XCVR_RX_DIG->DCOC_BBA_STEP = com_config->dcoc_bba_step_init;

            /* DCOC_TZA_STEP */
            XCVR_RX_DIG->DCOC_TZA_STEP_0 = com_config->dcoc_tza_step_00_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_1 = com_config->dcoc_tza_step_01_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_2 = com_config->dcoc_tza_step_02_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_3 = com_config->dcoc_tza_step_03_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_4 = com_config->dcoc_tza_step_04_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_5 = com_config->dcoc_tza_step_05_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_6 = com_config->dcoc_tza_step_06_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_7 = com_config->dcoc_tza_step_07_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_8 = com_config->dcoc_tza_step_08_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_9 = com_config->dcoc_tza_step_09_init;
            XCVR_RX_DIG->DCOC_TZA_STEP_10 = com_config->dcoc_tza_step_10_init;

#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
            /* DCOC_CAL_FAIL and DCOC_CAL_PASS */
            XCVR_RX_DIG->DCOC_CAL_FAIL_TH = com_config->dcoc_cal_fail_th_init;
            XCVR_RX_DIG->DCOC_CAL_PASS_TH = com_config->dcoc_cal_pass_th_init;
#endif /* (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1) */
        }
        /* AGC_CTRL_0 .. _3 */
#if !RADIO_IS_GEN_3P0 /* Gen3 radio has refactored code below to cover both clock and mode/datarate dependencies */
        XCVR_RX_DIG->AGC_CTRL_0 = com_config->agc_ctrl_0_init | mode_config->agc_ctrl_0_init;
#endif

#if RF_OSC_26MHZ == 1
        {
#if RADIO_IS_GEN_3P0
            XCVR_RX_DIG->AGC_CTRL_0 = com_config->agc_ctrl_0_init| mode_config->agc_ctrl_0_init | mode_datarate_config->agc_ctrl_0_init_26mhz;
            XCVR_RX_DIG->AGC_CTRL_1 = com_config->agc_ctrl_1_init_26mhz | mode_datarate_config->agc_ctrl_1_init_26mhz; /* Combine common and datarate specific settings */
#else
#if RADIO_IS_GEN_2P1
            XCVR_RX_DIG->AGC_CTRL_0 = com_config->agc_ctrl_0_init| mode_config->agc_ctrl_0_init | mode_datarate_config->agc_ctrl_0_init_26mhz;
#endif /* RADIO_IS_GEN_2P1 */
            XCVR_RX_DIG->AGC_CTRL_1 = com_config->agc_ctrl_1_init_26mhz | datarate_config->agc_ctrl_1_init_26mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_3P0 */
            XCVR_RX_DIG->AGC_CTRL_2 = mode_datarate_config->agc_ctrl_2_init_26mhz;
        }
#else
        {
#if RADIO_IS_GEN_3P0
            XCVR_RX_DIG->AGC_CTRL_0 = com_config->agc_ctrl_0_init| mode_config->agc_ctrl_0_init | mode_datarate_config->agc_ctrl_0_init_32mhz;
            XCVR_RX_DIG->AGC_CTRL_1 = com_config->agc_ctrl_1_init_32mhz | mode_datarate_config->agc_ctrl_1_init_32mhz; /* Combine common and datarate specific settings */
#else
#if RADIO_IS_GEN_2P1
            XCVR_RX_DIG->AGC_CTRL_0 = com_config->agc_ctrl_0_init| mode_config->agc_ctrl_0_init | mode_datarate_config->agc_ctrl_0_init_32mhz;
#endif /* RADIO_IS_GEN_2P1 */       

            XCVR_RX_DIG->AGC_CTRL_1 = com_config->agc_ctrl_1_init_32mhz | datarate_config->agc_ctrl_1_init_32mhz; /* Combine common and datarate specific settings */
#endif /* RADIO_IS_GEN_3P0 */
            XCVR_RX_DIG->AGC_CTRL_2 = mode_datarate_config->agc_ctrl_2_init_32mhz;
        }
#endif /* RF_OSC_26MHZ == 1 */

#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
                XCVR_RX_DIG->AGC_CTRL_3 = com_config->agc_ctrl_3_init | mode_datarate_config->agc_ctrl_3_init;
#else
                XCVR_RX_DIG->AGC_CTRL_3 = com_config->agc_ctrl_3_init;
#endif /* (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1) */

        if (first_init)
        {
            

            /* AGC_GAIN_TBL_** */
            XCVR_RX_DIG->AGC_GAIN_TBL_03_00 = com_config->agc_gain_tbl_03_00_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_07_04 = com_config->agc_gain_tbl_07_04_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_11_08 = com_config->agc_gain_tbl_11_08_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_15_12 = com_config->agc_gain_tbl_15_12_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_19_16 = com_config->agc_gain_tbl_19_16_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_23_20 = com_config->agc_gain_tbl_23_20_init;
            XCVR_RX_DIG->AGC_GAIN_TBL_26_24 = com_config->agc_gain_tbl_26_24_init;
            
            /* RSSI_CTRL_0 */
            XCVR_RX_DIG->RSSI_CTRL_0 = com_config->rssi_ctrl_0_init;
#if RADIO_IS_GEN_3P0
            XCVR_RX_DIG->RSSI_CTRL_1 = com_config->rssi_ctrl_1_init;
#endif /* RADIO_IS_GEN_3P0 */

            /* CCA_ED_LQI_0 and _1 */
            XCVR_RX_DIG->CCA_ED_LQI_CTRL_0 = com_config->cca_ed_lqi_ctrl_0_init;
            XCVR_RX_DIG->CCA_ED_LQI_CTRL_1 = com_config->cca_ed_lqi_ctrl_1_init;
        }
        
        /* Channel filter coefficients */
#if RF_OSC_26MHZ == 1
        {
            XCVR_RX_DIG->RX_CHF_COEF_0 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_0;
            XCVR_RX_DIG->RX_CHF_COEF_1 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_1;
            XCVR_RX_DIG->RX_CHF_COEF_2 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_2;
            XCVR_RX_DIG->RX_CHF_COEF_3 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_3;
            XCVR_RX_DIG->RX_CHF_COEF_4 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_4;
            XCVR_RX_DIG->RX_CHF_COEF_5 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_5;
            XCVR_RX_DIG->RX_CHF_COEF_6 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_6;
            XCVR_RX_DIG->RX_CHF_COEF_7 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_7;
            XCVR_RX_DIG->RX_CHF_COEF_8 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_8;
            XCVR_RX_DIG->RX_CHF_COEF_9 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_9;
            XCVR_RX_DIG->RX_CHF_COEF_10 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_10;
            XCVR_RX_DIG->RX_CHF_COEF_11 = mode_datarate_config->rx_chf_coeffs_26mhz.rx_chf_coef_11;
        }
#else
        {
            XCVR_RX_DIG->RX_CHF_COEF_0 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_0;
            XCVR_RX_DIG->RX_CHF_COEF_1 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_1;
            XCVR_RX_DIG->RX_CHF_COEF_2 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_2;
            XCVR_RX_DIG->RX_CHF_COEF_3 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_3;
            XCVR_RX_DIG->RX_CHF_COEF_4 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_4;
            XCVR_RX_DIG->RX_CHF_COEF_5 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_5;
            XCVR_RX_DIG->RX_CHF_COEF_6 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_6;
            XCVR_RX_DIG->RX_CHF_COEF_7 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_7;
            XCVR_RX_DIG->RX_CHF_COEF_8 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_8;
            XCVR_RX_DIG->RX_CHF_COEF_9 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_9;
            XCVR_RX_DIG->RX_CHF_COEF_10 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_10;
            XCVR_RX_DIG->RX_CHF_COEF_11 = mode_datarate_config->rx_chf_coeffs_32mhz.rx_chf_coef_11;
        }
#endif /* RF_OSC_26MHZ == 1 */
        XCVR_RX_DIG->RX_RCCAL_CTRL0 = mode_datarate_config->rx_rccal_ctrl_0;
        XCVR_RX_DIG->RX_RCCAL_CTRL1 = mode_datarate_config->rx_rccal_ctrl_1;

        XCVR_RX_DIG->AGC_MAN_AGC_IDX = mode_config->agc_man_agc_idx;
        /*******************************************************************************/
        /* XCVR_TSM configs */
        /*******************************************************************************/
        XCVR_TSM->CTRL = com_config->tsm_ctrl;

#if RADIO_IS_GEN_2P0
        if ((mode_config->radio_mode != ZIGBEE_MODE) && (mode_config->radio_mode != BLE_MODE))
        {
            XCVR_TSM->CTRL &= ~XCVR_TSM_CTRL_DATA_PADDING_EN_MASK;
        }
#endif /* RADIO_IS_GEN_2P0 */
        if (first_init)
        {
#if !RADIO_IS_GEN_2P1
            XCVR_MISC->LPPS_CTRL = com_config->lpps_ctrl_init; /* Register is in XCVR_MISC but grouped with TSM for intialization */
#endif /* !RADIO_IS_GEN_2P1 */

            XCVR_TSM->OVRD2 = com_config->tsm_ovrd2_init;
            /* TSM registers and timings - dependent upon clock frequency */
#if RF_OSC_26MHZ == 1
            {
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_26mhz;
                XCVR_TSM->FAST_CTRL2 = com_config->tsm_fast_ctrl2_init_26mhz;
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_26mhz;
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_26mhz;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_26mhz;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_26mhz;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_26mhz;
                XCVR_TSM->TIMING28 = com_config->tsm_timing_28_init_26mhz;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_26mhz;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_26mhz;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_26mhz;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_26mhz;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_26mhz;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_26mhz;
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_26mhz;
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_26mhz;
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_26mhz;
                XCVR_TSM->TIMING41 = com_config->tsm_timing_41_init_26mhz;
                XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_26mhz;
                XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_26mhz;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_26mhz;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_26mhz;
            }
#else
            {
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_32mhz;
                XCVR_TSM->FAST_CTRL2 = com_config->tsm_fast_ctrl2_init_32mhz;
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_32mhz;
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_32mhz;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_32mhz;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_32mhz;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_32mhz;
                XCVR_TSM->TIMING28 = com_config->tsm_timing_28_init_32mhz;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_32mhz;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_32mhz;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_32mhz;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_32mhz;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_32mhz;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_32mhz;
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_32mhz;
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_32mhz;
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_32mhz;
                XCVR_TSM->TIMING41 = com_config->tsm_timing_41_init_32mhz;
                XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_32mhz;
                XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_32mhz;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_32mhz;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_32mhz;
            }
#endif /* RF_OSC_26MHZ == 1 */
            /* TSM timings independent of clock frequency */
            XCVR_TSM->TIMING00 = com_config->tsm_timing_00_init;
            XCVR_TSM->TIMING01 = com_config->tsm_timing_01_init;
            XCVR_TSM->TIMING02 = com_config->tsm_timing_02_init;
            XCVR_TSM->TIMING03 = com_config->tsm_timing_03_init;
            XCVR_TSM->TIMING04 = com_config->tsm_timing_04_init;
            XCVR_TSM->TIMING05 = com_config->tsm_timing_05_init;
            XCVR_TSM->TIMING06 = com_config->tsm_timing_06_init;
            XCVR_TSM->TIMING07 = com_config->tsm_timing_07_init;
            XCVR_TSM->TIMING08 = com_config->tsm_timing_08_init;
            XCVR_TSM->TIMING09 = com_config->tsm_timing_09_init;
            XCVR_TSM->TIMING10 = com_config->tsm_timing_10_init;
            XCVR_TSM->TIMING11 = com_config->tsm_timing_11_init;
            XCVR_TSM->TIMING12 = com_config->tsm_timing_12_init;
            XCVR_TSM->TIMING13 = com_config->tsm_timing_13_init;
            XCVR_TSM->TIMING15 = com_config->tsm_timing_15_init;
            XCVR_TSM->TIMING17 = com_config->tsm_timing_17_init;
            XCVR_TSM->TIMING18 = com_config->tsm_timing_18_init;
            XCVR_TSM->TIMING19 = com_config->tsm_timing_19_init;
            XCVR_TSM->TIMING20 = com_config->tsm_timing_20_init;
            XCVR_TSM->TIMING21 = com_config->tsm_timing_21_init;
            XCVR_TSM->TIMING22 = com_config->tsm_timing_22_init;
            XCVR_TSM->TIMING23 = com_config->tsm_timing_23_init;
            XCVR_TSM->TIMING24 = com_config->tsm_timing_24_init;
            XCVR_TSM->TIMING26 = com_config->tsm_timing_26_init;
            XCVR_TSM->TIMING34 = com_config->tsm_timing_34_init;
            XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init;
            XCVR_TSM->TIMING38 = com_config->tsm_timing_38_init;
            XCVR_TSM->TIMING51 = com_config->tsm_timing_51_init;
            XCVR_TSM->TIMING53 = com_config->tsm_timing_53_init;
            XCVR_TSM->TIMING57 = com_config->tsm_timing_57_init;
            XCVR_TSM->TIMING58 = com_config->tsm_timing_58_init;

            XCVR_TSM->PA_RAMP_TBL0 = com_config->pa_ramp_tbl_0_init;
            XCVR_TSM->PA_RAMP_TBL1 = com_config->pa_ramp_tbl_1_init;
#if RADIO_IS_GEN_3P0
            XCVR_TSM->PA_RAMP_TBL2 = com_config->pa_ramp_tbl_2_init;
            XCVR_TSM->PA_RAMP_TBL3 = com_config->pa_ramp_tbl_3_init;

            /* Apply PA_RAMP_TIME == 4usec adjustments to TX_WD signals */
#if (PA_RAMP_TIME == 4)
            XCVR_TSM->TIMING00 += B1(2UL); /* (Controlled signal is bb_ldo_hf_en) */
            XCVR_TSM->TIMING01 += B1(2UL); /* (Controlled signal is bb_ldo_adcdac_en) */
            XCVR_TSM->TIMING03 += B1(2UL); /* (Controlled signal is bb_ldo_pd_en) */
            XCVR_TSM->TIMING04 += B1(2UL); /* (Controlled signal is bb_ldo_fdbk_en) */
            XCVR_TSM->TIMING05 += B1(2UL); /* (Controlled signal is bb_ldo_vcolo_en) */
            XCVR_TSM->TIMING06 += B1(2UL); /* (Controlled signal is bb_ldo_vtref_en) */
            XCVR_TSM->TIMING10 += B1(2UL); /* (Controlled signal is bb_xtal_pll_ref_clk_en) */
            XCVR_TSM->TIMING11 += B1(2UL); /* (Controlled signal is bb_xtal_dac_ref_clk_en) */
            XCVR_TSM->TIMING15 += B1(2UL); /* (Controlled signal is sy_vco_en) */
            XCVR_TSM->TIMING17 += B1(2UL); /* (Controlled signal is sy_lo_tx_buf_en) */
            XCVR_TSM->TIMING18 += B1(2UL); /* (Controlled signal is sy_divn_en) */
            XCVR_TSM->TIMING20 += B1(2UL); /*  (Controlled signal is sy_pd_en) */
            XCVR_TSM->TIMING21 += B1(2UL); /* (Controlled signal is sy_lo_divn_en) */
            XCVR_TSM->TIMING23 += B1(2UL); /* (Controlled signal is sy_lo_tx_en) */
            XCVR_TSM->TIMING26 += B1(2UL); /* (Controlled signal is tx_pa_en) */ 
            XCVR_TSM->TIMING34 += B1(2UL); /* (Controlled signal is pll_dig_en) */
            XCVR_TSM->TIMING35 += B1(2UL); /* (Controlled signal is tx_dig_en) */
            XCVR_TSM->TIMING38 += B1(2UL); /* (Controlled signal is sigma_delta_en) */
            XCVR_TSM->TIMING58 += B1(2UL)  /* (Controlled signal is tx_hpm_dac_en) */
            temp = XCVR_TSM->TIMING14;
            temp &= 0xFFFF0000UL; 
            temp |= B0(END_OF_TX_WU - 4UL) | B1(END_OF_TX_WU + 1UL); /* (Controlled signal is sy_pd_cycle_slip_ld_ft_en) */
            XCVR_TSM->TIMING14 = temp;
#endif /* (PA_RAMP_TIME == 4) */
#endif /* RADIO_IS_GEN_3P0 */
        }
        
#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
        if (mode_config->radio_mode == ZIGBEE_MODE)
        {
            temp = XCVR_TSM->TIMING35;
            temp &= ~(B0(0xFF));
            if (DATA_PADDING_EN == 1)
            {
                temp |= B0(END_OF_TX_WU - 2UL - 8UL); /* Adjust for data padding time */
            }
            else
            {
                temp |= B0(END_OF_TX_WU - 2UL); /* No data padding adjustment */
            }
            XCVR_TSM->TIMING35 = temp;
        }
#else

        if ((mode_datarate_config->radio_mode == MSK) && ((mode_datarate_config->data_rate == DR_500KBPS) || (mode_datarate_config->data_rate == DR_250KBPS)))
        {
            /* Apply a specific value of TX_DIG_EN which assumes no DATA PADDING */
            XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init | B0(TX_DIG_EN_ASSERT_MSK500); /* LSbyte is mode specific */
        }
        else
        {
            XCVR_TSM->TIMING35 = com_config->tsm_timing_35_init | mode_config->tsm_timing_35_init; /* LSbyte is mode specific, other bytes are common */
        }
#endif /* (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1) */
    
