Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
#if (RADIO_IS_GEN_3P0 && GFSK_250KBPS_TIMING_ADJUST)
        /* Adjust TSM RX WU and WD timings to allow for custom DCOC calibration time for 250Kbps data rates */
        if ((mode_config->radio_mode != ZIGBEE_MODE) && (mode_datarate_config->data_rate == DR_250KBPS))
        {
#if RF_OSC_26MHZ == 1
            {
                XCVR_RX_DIG->DCOC_CTRL_0 = (com_config->dcoc_ctrl_0_init_26mhz+XCVR_RX_DIG_DCOC_CTRL_0_DCOC_CAL_DURATION(GFSK_250K_DC_CAL_STEP_DELAY-4UL)) |  /* -4 adjustment is due to sensitivity fallout that showed up in v1.99 settings */
                                mode_datarate_config->dcoc_ctrl_0_init_26mhz; /* Combine common and datarate specific settings */
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_26mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_26mhz+(B2(GFSK_250K_DC_CAL_STEP_DELAY*3) | B0(GFSK_250K_DC_CAL_STEP_DELAY*3));
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_26mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_26mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_26mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_26mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
            }
#else
            {
                XCVR_RX_DIG->DCOC_CTRL_0 = (com_config->dcoc_ctrl_0_init_32mhz+XCVR_RX_DIG_DCOC_CTRL_0_DCOC_CAL_DURATION(GFSK_250K_DC_CAL_STEP_DELAY)) | 
                    mode_datarate_config->dcoc_ctrl_0_init_32mhz; /* Combine common and datarate specific settings */
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_32mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_32mhz+(B2(GFSK_250K_DC_CAL_STEP_DELAY*3) | B0(GFSK_250K_DC_CAL_STEP_DELAY*3));
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_32mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_32mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_32mhz+GFSK_250K_RX_WU_WD_ADJUST; /* Adjust both WU and WD */
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_32mhz+GFSK_250K_RX_WD_ONLY_ADJUST;
            }
#endif /* RF_OSC_26MHZ == 1 */
            /* TSM timings independent of clock frequency */
            XCVR_TSM->TIMING00 = com_config->tsm_timing_00_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING01 = com_config->tsm_timing_01_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING02 = com_config->tsm_timing_02_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING03 = com_config->tsm_timing_03_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING04 = com_config->tsm_timing_04_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING05 = com_config->tsm_timing_05_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING06 = com_config->tsm_timing_06_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING10 = com_config->tsm_timing_10_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING12 = com_config->tsm_timing_12_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING15 = com_config->tsm_timing_15_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING18 = com_config->tsm_timing_18_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING20 = com_config->tsm_timing_20_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING21 = com_config->tsm_timing_21_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING22 = com_config->tsm_timing_22_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING34 = com_config->tsm_timing_34_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING38 = com_config->tsm_timing_38_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING51 = com_config->tsm_timing_51_init+GFSK_250K_RX_WD_ONLY_ADJUST;
            XCVR_TSM->TIMING53 = com_config->tsm_timing_53_init+GFSK_250K_RX_WD_ONLY_ADJUST;
        }
        else
        /* program original TSM RX WU & WD timings */        
        {
#if RF_OSC_26MHZ == 1
            {
                XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_26mhz | mode_datarate_config->dcoc_ctrl_0_init_26mhz; /* Combine common and datarate specific settings */
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_26mhz;
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_26mhz;
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_26mhz;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_26mhz;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_26mhz;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_26mhz;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_26mhz;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_26mhz;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_26mhz;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_26mhz;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_26mhz;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_26mhz;
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_26mhz;
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_26mhz;
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_26mhz;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_26mhz;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_26mhz;
            }
#else
            {
                XCVR_RX_DIG->DCOC_CTRL_0 = com_config->dcoc_ctrl_0_init_32mhz | mode_datarate_config->dcoc_ctrl_0_init_32mhz; /* Combine common and datarate specific settings */
                XCVR_TSM->END_OF_SEQ = com_config->end_of_seq_init_32mhz;
                XCVR_TSM->FAST_CTRL2 = com_config->tsm_fast_ctrl2_init_32mhz;
                XCVR_TSM->RECYCLE_COUNT = com_config->recycle_count_init_32mhz;
                XCVR_TSM->TIMING14 = com_config->tsm_timing_14_init_32mhz;
                XCVR_TSM->TIMING16 = com_config->tsm_timing_16_init_32mhz;
                XCVR_TSM->TIMING25 = com_config->tsm_timing_25_init_32mhz;
                XCVR_TSM->TIMING27 = com_config->tsm_timing_27_init_32mhz;
                XCVR_TSM->TIMING29 = com_config->tsm_timing_29_init_32mhz;
                XCVR_TSM->TIMING30 = com_config->tsm_timing_30_init_32mhz;
                XCVR_TSM->TIMING31 = com_config->tsm_timing_31_init_32mhz;
                XCVR_TSM->TIMING32 = com_config->tsm_timing_32_init_32mhz;
                XCVR_TSM->TIMING33 = com_config->tsm_timing_33_init_32mhz;
                XCVR_TSM->TIMING36 = com_config->tsm_timing_36_init_32mhz;
                XCVR_TSM->TIMING37 = com_config->tsm_timing_37_init_32mhz;
                XCVR_TSM->TIMING39 = com_config->tsm_timing_39_init_32mhz;
                XCVR_TSM->TIMING40 = com_config->tsm_timing_40_init_32mhz;
                XCVR_TSM->TIMING52 = com_config->tsm_timing_52_init_32mhz;
                XCVR_TSM->TIMING54 = com_config->tsm_timing_54_init_32mhz;
                XCVR_TSM->TIMING55 = com_config->tsm_timing_55_init_32mhz;
                XCVR_TSM->TIMING56 = com_config->tsm_timing_56_init_32mhz;
            }
#endif /* RF_OSC_26MHZ == 1 */
            /* TSM timings independent of clock frequency */
            XCVR_TSM->TIMING00 = com_config->tsm_timing_00_init;
            XCVR_TSM->TIMING01 = com_config->tsm_timing_01_init;
            XCVR_TSM->TIMING02 = com_config->tsm_timing_02_init;
            XCVR_TSM->TIMING03 = com_config->tsm_timing_03_init;
            XCVR_TSM->TIMING04 = com_config->tsm_timing_04_init;
            XCVR_TSM->TIMING05 = com_config->tsm_timing_05_init;
            XCVR_TSM->TIMING06 = com_config->tsm_timing_06_init;
            XCVR_TSM->TIMING10 = com_config->tsm_timing_10_init;
            XCVR_TSM->TIMING12 = com_config->tsm_timing_12_init;
            XCVR_TSM->TIMING15 = com_config->tsm_timing_15_init;
            XCVR_TSM->TIMING18 = com_config->tsm_timing_18_init;
            XCVR_TSM->TIMING20 = com_config->tsm_timing_20_init;
            XCVR_TSM->TIMING21 = com_config->tsm_timing_21_init;
            XCVR_TSM->TIMING22 = com_config->tsm_timing_22_init;
            XCVR_TSM->TIMING34 = com_config->tsm_timing_34_init;
            XCVR_TSM->TIMING38 = com_config->tsm_timing_38_init;
            XCVR_TSM->TIMING51 = com_config->tsm_timing_51_init;
            XCVR_TSM->TIMING53 = com_config->tsm_timing_53_init;
        }

