Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
#endif /* RADIO_IS_GEN_3P0 && GFSK_250KBPS_TIMING_ADJUST */


        /*******************************************************************************/
        /* XCVR_TX_DIG configs */
        /*******************************************************************************/
#if RF_OSC_26MHZ == 1
        {
            XCVR_TX_DIG->FSK_SCALE = mode_datarate_config->tx_fsk_scale_26mhz; /* Applies only to 802.15.4 & MSK but won't harm other protocols */
            XCVR_TX_DIG->GFSK_COEFF1 = mode_config->tx_gfsk_coeff1_26mhz;
            XCVR_TX_DIG->GFSK_COEFF2 = mode_config->tx_gfsk_coeff2_26mhz;
        }
#else
        {
            XCVR_TX_DIG->FSK_SCALE = mode_datarate_config->tx_fsk_scale_32mhz; /* Applies only to 802.15.4 & MSK but won't harm other protocols */
            XCVR_TX_DIG->GFSK_COEFF1 = mode_config->tx_gfsk_coeff1_32mhz;
            XCVR_TX_DIG->GFSK_COEFF2 = mode_config->tx_gfsk_coeff2_32mhz;
        }
#endif /* RF_OSC_26MHZ == 1 */
        if (first_init)
        {
            XCVR_TX_DIG->CTRL = com_config->tx_ctrl;
            XCVR_TX_DIG->DATA_PADDING = com_config->tx_data_padding;
            XCVR_TX_DIG->DFT_PATTERN = com_config->tx_dft_pattern;
#if ((!RADIO_IS_GEN_2P1) && (!RADIO_IS_GEN_3P0))
            XCVR_TX_DIG->RF_DFT_BIST_1 = com_config->rf_dft_bist_1;
            XCVR_TX_DIG->RF_DFT_BIST_2 = com_config->rf_dft_bist_2;
#endif /* !RADIO_IS_GEN_2P1 */
        }
        XCVR_TX_DIG->GFSK_CTRL = mode_config->tx_gfsk_ctrl;
    }

    return config_status;
}

void XCVR_Reset(void)
{
#if RADIO_IS_GEN_3P0
    RSIM->SW_CONFIG |= RSIM_SW_CONFIG_RADIO_RESET_BIT_MASK; /* Assert radio software reset */
    asm("NOP");
    asm("NOP");
    RSIM->SW_CONFIG &= ~RSIM_SW_CONFIG_RADIO_RESET_BIT_MASK; /* De-assert radio software reset */
    asm("NOP");
    asm("NOP");
    RSIM->SW_CONFIG &= ~RSIM_SW_CONFIG_RADIO_RESET_BIT_MASK; /* De-assert radio software reset a second time (following Gen2 behavior) */
#else
    RSIM->CONTROL |= RSIM_CONTROL_RADIO_RESET_BIT_MASK; /* Assert radio software reset */
    asm("NOP");
    asm("NOP");
    RSIM->CONTROL &= ~RSIM_CONTROL_RADIO_RESET_BIT_MASK; /* De-assert radio software reset */
    asm("NOP");
    asm("NOP");
    RSIM->CONTROL &= ~RSIM_CONTROL_RADIO_RESET_BIT_MASK; /* De-assert radio software reset a second time per RADIO_RESET bit description */
#endif /* RADIO_IS_GEN_3P0 */
}

xcvrStatus_t XCVR_ChangeMode (radio_mode_t new_radio_mode, data_rate_t new_data_rate) /* Change from one radio mode to another */
{
    xcvrStatus_t status;
    const xcvr_mode_datarate_config_t * mode_datarate_config;
    const xcvr_datarate_config_t * datarate_config ;
    const xcvr_mode_config_t * radio_mode_cfg;
    const xcvr_common_config_t * radio_common_config;

    status = XCVR_GetDefaultConfig(new_radio_mode, new_data_rate, (void *)&radio_common_config, (void *)&radio_mode_cfg, (void *)&mode_datarate_config, (void *)&datarate_config );
    
    if (status == gXcvrSuccess_c)
    {
        status = XCVR_Configure((const xcvr_common_config_t *)radio_common_config, 
                                (const xcvr_mode_config_t *)radio_mode_cfg, 
                                (const xcvr_mode_datarate_config_t *)mode_datarate_config, 
                                (const xcvr_datarate_config_t *)datarate_config, XCVR_MODE_CHANGE);
        current_xcvr_config.radio_mode = new_radio_mode;
        current_xcvr_config.data_rate = datarate_config->data_rate;
    }

    return status;
}

void XCVR_EnaNBRSSIMeas( uint8_t IIRnbEnable )
{
    if (IIRnbEnable)
    {
        XCVR_RX_DIG->RSSI_CTRL_0 |= XCVR_RX_DIG_RSSI_CTRL_0_RSSI_IIR_CW_WEIGHT_MASK;
    }
    else
    {
        XCVR_RX_DIG->RSSI_CTRL_0 &= ~XCVR_RX_DIG_RSSI_CTRL_0_RSSI_IIR_CW_WEIGHT_MASK;
    }
}

xcvrStatus_t XCVR_OverrideFrequency ( uint32_t freq, uint32_t refOsc )
{
    double integer_used_in_Hz, 
           integer_used_in_LSB, 
           numerator_fraction, 
           numerator_in_Hz, 
           numerator_in_LSB, 
           numerator_unrounded,
           real_int_and_fraction, 
           real_fraction, 
           requested_freq_in_LSB,
           sdm_lsb;
    uint32_t temp;
    static uint32_t integer_truncated,
                    integer_to_use;
    static int32_t numerator_rounded;
    const  uint32_t denominator = 0x08000000UL - 1UL; /* Configure the PLL Denominator to the max for best resolution */
    /* Configure for Coarse Tune */
    uint32_t coarse_tune_target = freq / 1000000;
    
    /* Write the Low Port Denomintor value */
    XCVR_PLL_DIG->LPM_SDM_CTRL3 = denominator;
    
    temp  =  XCVR_PLL_DIG->CTUNE_CTRL;
    temp &= ~XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL_MASK;
    temp |=  XCVR_PLL_DIG_CTUNE_CTRL_CTUNE_TARGET_MANUAL(coarse_tune_target);
    XCVR_PLL_DIG->CTUNE_CTRL = temp;

    /* Calculate the Low Port values */

    sdm_lsb = (double)refOsc / (denominator/2);
    real_int_and_fraction = freq / (refOsc * 2.0);
    integer_truncated = (uint32_t) trunc(real_int_and_fraction);
    real_fraction = real_int_and_fraction - integer_truncated;

    if (real_fraction > 0.5) 
    {
        integer_to_use = integer_truncated + 1;
    } 
    else                     
    {
        integer_to_use = integer_truncated;
    }

    numerator_fraction = real_int_and_fraction - integer_to_use;

    integer_used_in_Hz  = integer_to_use * refOsc * 2;
    integer_used_in_LSB = integer_used_in_Hz / sdm_lsb;

    numerator_in_Hz  = numerator_fraction * refOsc * 2;
    numerator_in_LSB = numerator_in_Hz    / sdm_lsb;

    requested_freq_in_LSB = integer_used_in_LSB + numerator_in_LSB;
    numerator_unrounded = (requested_freq_in_LSB - integer_used_in_LSB);
    numerator_rounded = (int32_t) round(numerator_unrounded);

    /* Write the Low Port Integer and Numerator */
    temp  =  XCVR_PLL_DIG->LPM_SDM_CTRL1;
    temp &= ~XCVR_PLL_DIG_LPM_SDM_CTRL1_LPM_INTG_MASK;
    temp |= (XCVR_PLL_DIG_LPM_SDM_CTRL1_LPM_INTG(integer_to_use) | 
             XCVR_PLL_DIG_LPM_SDM_CTRL1_SDM_MAP_DISABLE_MASK);
    XCVR_PLL_DIG->LPM_SDM_CTRL1 = temp;
    XCVR_PLL_DIG->LPM_SDM_CTRL2 = numerator_rounded;

    return gXcvrSuccess_c;
}

void XCVR_RegisterPanicCb ( panic_fptr fptr ) /* Allow upper layers to provide PANIC callback */
{
    s_PanicFunctionPtr = fptr;
}

void XcvrPanic(XCVR_PANIC_ID_T panic_id, uint32_t panic_address)
{
    if ( s_PanicFunctionPtr != NULL)
    {
        s_PanicFunctionPtr(panic_id, panic_address, 0, 0);
    }
    else
    {
        uint8_t dummy;

        while(1)
        {
            dummy = dummy;
        }
    }
}

