Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
    if (status == gXcvrSuccess_c)
    {
        /* Warm-up the Radio */
        XCVR_ForceTxWu();
    }

    return status;
}

xcvrStatus_t XCVR_DftTxLfsrReg(uint16_t channel_num, radio_mode_t radio_mode, data_rate_t data_rate, uint8_t lfsr_length)
{
    uint32_t temp;
    uint8_t dft_mode = 0;
    uint8_t dft_clk_sel = 0;
    xcvrStatus_t status = gXcvrSuccess_c;

    if (lfsr_length > 5)
    {
        status = gXcvrInvalidParameters_c;
    }

    if (status == gXcvrSuccess_c)
    {
        XCVR_ChangeMode(radio_mode, data_rate);
        
        /* Select the RF Channel, using the Channel Number register */
        XCVR_OverrideChannel(channel_num,1);

        switch (radio_mode)
        {
            case ZIGBEE_MODE:
                dft_mode = 7;    /* OQPSK configuration */
                break;
            case ANT_MODE:
            case BLE_MODE:
            case GFSK_BT_0p5_h_0p5:
            case GFSK_BT_0p5_h_0p32:
            case GFSK_BT_0p5_h_0p7:
            case GFSK_BT_0p5_h_1p0:
            case GFSK_BT_0p3_h_0p5:
            case GFSK_BT_0p7_h_0p5:
                dft_mode = 3; /* GFSK configuration */
                break;
            case MSK:
                dft_mode = 5;     /* MSK configuration */
                break;

            default:    
                status = gXcvrInvalidParameters_c;
                break;
        }

        if (status == gXcvrSuccess_c)
        {
            switch (data_rate)
            {
                case DR_1MBPS:
                    dft_clk_sel = 4;
                    break;
                case DR_500KBPS:
                    dft_clk_sel = 3;
                    break;
                case DR_250KBPS:
                    dft_clk_sel = 2;
                    break;
                default:
                    status = gXcvrInvalidParameters_c;
                    break;
            }
        }

        if (status == gXcvrSuccess_c)
        {
            temp = XCVR_TX_DIG->CTRL;
            temp &= ~(XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK |
                XCVR_TX_DIG_CTRL_LFSR_LENGTH_MASK |
                XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK | 
                XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK | 
                XCVR_TX_DIG_CTRL_LFSR_EN_MASK);
            temp |=  XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(dft_mode) | 
                    XCVR_TX_DIG_CTRL_LFSR_LENGTH(lfsr_length) |
                    XCVR_TX_DIG_CTRL_DFT_CLK_SEL(dft_clk_sel) |
                    XCVR_TX_DIG_CTRL_TX_DFT_EN(0) |
                    XCVR_TX_DIG_CTRL_LFSR_EN(1);
            XCVR_TX_DIG->CTRL = temp;

            /* Warm-up the Radio */
            XCVR_ForceTxWu();
        }
    }

    return status;
}

void XCVR_DftTxOff(void)
{
    XCVR_ForceTxWd();
    XCVR_MISC->XCVR_CTRL |= XCVR_CTRL_XCVR_CTRL_TGT_PWR_SRC_MASK; /* Use PA_POWER in LL registers */
    /* Clear the RF Channel over-ride */
    XCVR_OverrideChannel(0xFF,1);
    XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK | /* Clear DFT_MODE */
                           XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK | /* Clear DFT_CLK_SEL */
                           XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK | /* Clear DFT_EN */
                           XCVR_TX_DIG_CTRL_LFSR_EN_MASK);/* Clear LFSR_EN */
}

xcvrStatus_t XCVR_ForcePAPower(uint8_t pa_power)
{
    xcvrStatus_t status = gXcvrSuccess_c;

    /* PA power range check */
    if (pa_power > 0x3F)
    {
        status = gXcvrInvalidParameters_c; /* Failure */
    }

    if (status == gXcvrSuccess_c)
    {
        if (pa_power != 1)
        {
            pa_power = pa_power & 0xFEU; /* Ensure LSbit is cleared */
        }
        
        XCVR_MISC->XCVR_CTRL &= ~XCVR_CTRL_XCVR_CTRL_TGT_PWR_SRC_MASK; /* Use PA_POWER in TSM registers */
        XCVR_TSM->PA_POWER = pa_power;
    }
    
    return status; /* Success */
}

#if (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1)
xcvrStatus_t XCVR_SetManAgc(uint8_t man_agc_idx)
{
    xcvrStatus_t status = gXcvrSuccess_c;
    if (man_agc_idx >26)
    {
        /* error case */
        status = gXcvrInvalidParameters_c;
    }
    else
    {
        SetManAgcAutoDCOC(man_agc_idx);
    }
    return status;
}

void XCVR_ClearManAgc(void)
{
    ClearManAgc();
}
#endif /* (RADIO_IS_GEN_3P0 || RADIO_IS_GEN_2P1) */

xcvrStatus_t XCVR_CoexistenceInit(void)
{
#if gMWS_UseCoexistence_d  
    uint32_t temp = 0x00U;
    uint32_t end_of_tx_wu = 0x00U;
    uint32_t end_of_rx_wu = 0x00U;
    
#if (defined(CPU_MKW20Z160VHT4) || defined(CPU_MKW30Z160VHM4) || defined(CPU_MKW40Z160VHT4) || \
     defined(CPU_MKW21Z256VHT4) || defined(CPU_MKW21Z512VHT4) || defined(CPU_MKW31Z256CAx4) || \
     defined(CPU_MKW31Z256VHT4) || defined(CPU_MKW31Z512CAx4) || defined(CPU_MKW31Z512VHT4) || \
     defined(CPU_MKW41Z256VHT4) || defined(CPU_MKW41Z512VHT4))

#if (gMWS_Coex_Model_d == gMWS_Coex_Status_Prio_d)
#if (XCVR_COEX_RF_ACTIVE_PIN == ANT_A)
    uint32_t tsm_timing47 = 0x00U;
#else /* (XCVR_COEX_RF_ACTIVE_PIN == ANT_B) */
    uint32_t tsm_timing48 = 0x00U;
#endif /* (XCVR_COEX_RF_ACTIVE_PIN == ANT_A) */
    uint32_t tsm_timing50 = 0x00U;
#endif /* (gMWS_Coex_Model_d == gMWS_Coex_Status_Prio_d) */

#if (gMWS_Coex_Model_d == gMWS_Coex_Prio_Only_d)
    // RF_ACTIVE = ANT_B (PTC1, gpio1_trig_en)
    uint32_t tsm_timing48 = 0x00U;
    // RF_PRIORITY = ANT_A (PTC4, gpio0_trig_en)
    uint32_t tsm_timing47 = 0x00U;
#endif /* (gMWS_Coex_Model_d == gMWS_Coex_Prio_Only_d) */

    uint16_t tsm_timing43_rx = 0x00;
    uint16_t tsm_timing43_tx = 0x00;

    /* Select GPIO mode for FAD pins */
    temp = XCVR_MISC->FAD_CTRL;
    temp &= ~(XCVR_CTRL_FAD_CTRL_FAD_NOT_GPIO_MASK);
    XCVR_MISC->FAD_CTRL = temp;

    /* Read the END_OF_TX_WU and END_OF_RX_WU for XCVR */
    end_of_tx_wu = (XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_MASK) >>
                    XCVR_TSM_END_OF_SEQ_END_OF_TX_WU_SHIFT;
    end_of_rx_wu = (XCVR_TSM->END_OF_SEQ & XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK) >>
                    XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT;

/*****************
 *  TX SEQUENCE  *
 *****************/

    if (end_of_tx_wu < gMWS_CoexRfActiveAssertTime_d)
    {
        temp = end_of_tx_wu;
    }
    else
    {
        temp = gMWS_CoexRfActiveAssertTime_d;
    }
    
