Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
#elif (defined(CPU_MKW36A512VHT4) || defined(CPU_MKW36A512VFP4) || defined(CPU_MKW36A512VFT4) || \
       defined(CPU_MKW36Z512VHT4) || defined(CPU_MKW36Z512VFP4) || defined(CPU_MKW35A512VFP4) || \
       defined(CPU_MKW35A512VFT4) || defined(CPU_MKW35Z512VHT4) || defined(CPU_MKW34A512VFT4))

    static uint32_t tsm_timing49_saved = 0x00;
    static uint32_t tsm_timing50_saved = 0x00;

    if (saveTimings == 0)
    {
        /* Restore registers values. */
        XCVR_TSM->OVRD0 = tsm_ovrd0_saved;
        XCVR_TSM->OVRD1 = tsm_ovrd1_saved;
        XCVR_TSM->OVRD2 = tsm_ovrd2_saved;
        XCVR_TSM->OVRD3 = tsm_ovrd3_saved;

        XCVR_TSM->TIMING47 = tsm_timing47_saved;
        XCVR_TSM->TIMING48 = tsm_timing48_saved;
        XCVR_TSM->TIMING49 = tsm_timing49_saved;
        XCVR_TSM->TIMING50 = tsm_timing50_saved;
    }
    else
    {
        /* Save registers values. */
        tsm_ovrd0_saved = XCVR_TSM->OVRD0;
        tsm_ovrd1_saved = XCVR_TSM->OVRD1;
        tsm_ovrd2_saved = XCVR_TSM->OVRD2;
        tsm_ovrd3_saved = XCVR_TSM->OVRD3;
        tsm_timing47_saved = XCVR_TSM->TIMING47;
        tsm_timing48_saved = XCVR_TSM->TIMING48;
        tsm_timing49_saved = XCVR_TSM->TIMING49;
        tsm_timing50_saved = XCVR_TSM->TIMING50;
    }

#endif /* CPU_MKW35Axxx / CPU_MKW36Axxx */

#endif /* gMWS_UseCoexistence_d */

    return gXcvrSuccess_c;
}


#if (((RADIO_IS_GEN_3P0) || (RADIO_IS_GEN_2P1)) && defined(PA_FEM_SUPPORTED))
xcvrStatus_t XCVR_ExternalFadPaFemInit(xcvr_pa_fem_config_t * pa_fem_settings_ptr)
{
    xcvrStatus_t status = gXcvrSuccess_c; 
    uint32_t temp_reg = 0;
    uint8_t subfield;
    uint8_t wu_time;
    uint8_t wd_time;

    /* Perform any input verification checks needed and update status appropriately */
    if (pa_fem_settings_ptr == NULL)
    {
        status = gXcvrInvalidParameters_c;
    }
    else
    {
        /* Check contents of the initialization structure */

#if RADIO_IS_GEN_2P1
        /* FAD is not supported at all on KW35 */
        if ((pa_fem_settings_ptr->use_fad_state_machine) ||
            (pa_fem_settings_ptr->tx_switch_pad_control) || 
            (pa_fem_settings_ptr->rx_switch_pad_control))
#else
        /* when FAD state machine is in use, ANT_A and ANT_B must be under FAD state machine control */
        if ((pa_fem_settings_ptr->use_fad_state_machine) && 
            ((pa_fem_settings_ptr->ant_a_pad_control == XCVR_FAD_TSM_GPIO) || 
            (pa_fem_settings_ptr->ant_b_pad_control == XCVR_FAD_TSM_GPIO)))
#endif /* RADIO_IS_GEN_2P1 */
        {
            status = gXcvrInvalidConfiguration_c;
        }

        /* All of the below parameters must be either 0 or 1 and are treated as booleans so OR them together and check for > 1 to validate them */
        if (((uint32_t)pa_fem_settings_ptr->op_mode | 
            (uint32_t)(pa_fem_settings_ptr->high_z_enable) | 
            (uint32_t)pa_fem_settings_ptr->ant_sel_pins_enable | 
            (uint32_t)pa_fem_settings_ptr->tx_rx_switch_pins_enable | 
            (uint32_t)pa_fem_settings_ptr->use_fad_state_machine | 
            (uint32_t)pa_fem_settings_ptr->ant_a_pad_control | 
            (uint32_t)pa_fem_settings_ptr->ant_b_pad_control | 
            (uint32_t)pa_fem_settings_ptr->tx_switch_pad_control | 
            (uint32_t)pa_fem_settings_ptr->rx_switch_pad_control |
            (uint32_t)pa_fem_settings_ptr->tx_switch_pol_control |
            (uint32_t)pa_fem_settings_ptr->rx_switch_pol_control) > 1U)
        {
            status = gXcvrInvalidParameters_c;
        }
    }

    /* If input verification checks have passed then perform the PA/FEM initialization */
    if (status == gXcvrSuccess_c)
    {
        temp_reg |= XCVR_CTRL_FAD_CTRL_ANTX_HZ(pa_fem_settings_ptr->high_z_enable);      /* Set High Z if enabled */
        temp_reg |= XCVR_CTRL_FAD_CTRL_ANTX_CTRLMODE(pa_fem_settings_ptr->op_mode);     /* Set control mode */
        subfield = (((uint32_t)pa_fem_settings_ptr->rx_switch_pol_control<<3) | ((uint32_t)pa_fem_settings_ptr->tx_switch_pol_control<<2)); /* Build field value for ANTX_POL */
        temp_reg |= XCVR_CTRL_FAD_CTRL_ANTX_POL(subfield);
        subfield= (((uint32_t)pa_fem_settings_ptr->rx_switch_pad_control<<3) |    /* Build field value for FAD_NOT_GPIO */
                    ((uint32_t)pa_fem_settings_ptr->tx_switch_pad_control<<2) |
                    ((uint32_t)pa_fem_settings_ptr->ant_b_pad_control<<1) |
                    ((uint32_t)pa_fem_settings_ptr->ant_a_pad_control<<0));
        temp_reg |= XCVR_CTRL_FAD_CTRL_FAD_NOT_GPIO(subfield);
#if RADIO_IS_GEN_3P0
        /* build and program ANTX_EN field for K3. Doesn't exist on KW35 */
        subfield = (((uint32_t)pa_fem_settings_ptr->ant_sel_pins_enable<<1) | ((uint32_t)pa_fem_settings_ptr->tx_rx_switch_pins_enable<<0));
        temp_reg |= XCVR_CTRL_FAD_CTRL_ANTX_EN(subfield);
        temp_reg |= XCVR_CTRL_FAD_CTRL_FAD_EN(pa_fem_settings_ptr->use_fad_state_machine);
#endif /* RADIO_IS_GEN_3P0 */
        XCVR_MISC->FAD_CTRL = temp_reg;

        /* Program TSM Timing registers for TSM_GPIO_2 (tx switch) and TSM_GPIO_3 (rx switch) */
        wu_time = ((XCVR_TSM->TIMING26&XCVR_TSM_TIMING26_TX_PA_EN_TX_HI_MASK)>>XCVR_TSM_TIMING26_TX_PA_EN_TX_HI_SHIFT)-pa_fem_settings_ptr->pa_tx_wu;
        wd_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_TX_WD_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_TX_WD_SHIFT)-pa_fem_settings_ptr->pa_tx_wd;
        /* The TX timing advance value must be strictly less than the difference between wd_time and wu_time due to TSM counter restrictions. */
        if (pa_fem_settings_ptr->pa_tx_wd < (wd_time-wu_time))
        {
            XCVR_TSM->TIMING49 = B3(0xFFU) | B2(0xFFU) | B1(wd_time) | B0(wu_time); /* TSM_GPIO_2 (tx switch) */
        }
        else
        {
            status = gXcvrInvalidConfiguration_c;
        }
        wu_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT)-pa_fem_settings_ptr->lna_rx_wu;
        wd_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_RX_WD_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_RX_WD_SHIFT)-pa_fem_settings_ptr->lna_rx_wd;
        /* The RX timing advance value must be strictly less than the difference between wd_time and wu_time due to TSM counter restrictions. */
        if (pa_fem_settings_ptr->lna_rx_wd < (wd_time-wu_time))
        {
            XCVR_TSM->TIMING50 = B3(wd_time) | B2(wu_time) | B1(0xFFU) | B0(0xFFU); /* TSM_GPIO_3 (rx switch) */
        }
        else
        {
            status = gXcvrInvalidConfiguration_c;
        }
    }
             
