Masmiseim36/nxpSDK/middleware/wireless/framework_5.4.11/XCVR/MKW36Z4/fsl_xcvr.c
     return status;
}

xcvrStatus_t XCVR_ExternalFadPaFemDeInit(void)
{
    XCVR_TSM->TIMING49 = 0xFFFFFFFFUL;
    XCVR_TSM->TIMING50 = 0xFFFFFFFFUL;
    XCVR_MISC->FAD_CTRL = 0x0UL;
    return gXcvrSuccess_c;
}

#if RADIO_IS_GEN_3P0
void XCVR_ExtAntOvrd(XCVR_FAD_OVRD_ANT_A_B_SEL_MODE_T antenna_sel)
{
    uint32_t temp_reg = XCVR_MISC->FAD_CTRL;
    if (antenna_sel == XCVR_FAD_OVRD_SEL_ANT_A)
    {
        temp_reg &= ~XCVR_CTRL_FAD_CTRL_ANTX_OVRD_MASK;
    }
    else
    {
        temp_reg |= XCVR_CTRL_FAD_CTRL_ANTX_OVRD_MASK;
    }
    XCVR_MISC->FAD_CTRL = temp_reg | XCVR_CTRL_FAD_CTRL_ANTX_OVRD_EN_MASK;
}

void XCVR_ExtAntRelease(void)
{
    XCVR_MISC->FAD_CTRL &= ~XCVR_CTRL_FAD_CTRL_ANTX_OVRD_EN_MASK;
}


xcvrStatus_t XCVR_FadPaFemOnCoexInit(xcvr_pa_fem_config_t * test_settings, tx_rx_coex_pin_func_t rf_status_func, tx_rx_coex_pin_func_t rf_priority_func)
{
    uint8_t tx_wu_time;
    uint8_t tx_wd_time;
    uint8_t rx_wu_time;
    uint8_t rx_wd_time;
    uint32_t temp;
    xcvrStatus_t lastStatus = gXcvrSuccess_c;

    /* Perform any input verification checks needed and update status appropriately */
    if (test_settings == NULLPTR)
    {
        lastStatus = gXcvrInvalidParameters_c;
    }
    else
    {
        RSIM->CONTROL &= ~(RSIM_CONTROL_IPP_OBE_RF_PRIORITY_MASK | RSIM_CONTROL_IPP_OBE_RF_STATUS_MASK); /* Ensure both enable bits are cleared to start out. */
        tx_wu_time = ((XCVR_TSM->TIMING26&XCVR_TSM_TIMING26_TX_PA_EN_TX_HI_MASK)>>XCVR_TSM_TIMING26_TX_PA_EN_TX_HI_SHIFT)-test_settings->pa_tx_wu;
        tx_wd_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_TX_WD_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_TX_WD_SHIFT)-test_settings->pa_tx_wd;
        rx_wu_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_RX_WU_SHIFT)-test_settings->lna_rx_wu;
        rx_wd_time = ((XCVR_TSM->END_OF_SEQ&XCVR_TSM_END_OF_SEQ_END_OF_RX_WD_MASK)>>XCVR_TSM_END_OF_SEQ_END_OF_RX_WD_SHIFT)-test_settings->lna_rx_wd;
        /* The TX & RX timing advance values must be strictly less than the difference between wd_time and wu_time due to TSM counter restrictions. */
        if ((test_settings->pa_tx_wd < (tx_wd_time-tx_wu_time)) && (test_settings->lna_rx_wd < (rx_wd_time-rx_wu_time)))
        {
            lastStatus = gXcvrSuccess_c;
            if (rf_status_func != NO_FUNC)
            {
                switch (rf_status_func)
                {
                    case TX_FUNC:
                        temp = B3(0xFFU) | B2(0xFFU) | B1(tx_wd_time) | B0(tx_wu_time); /*  (tx switch) */
                        break;
                    case RX_FUNC:
                        temp = B3(rx_wd_time) | B2(rx_wu_time) | B1(0xFFU) | B0(0xFFU); /*  (rx switch) */
                        break;
                    case BOTH_TX_RX_FUNC:
                        temp = B3(rx_wd_time) | B2(rx_wu_time) | B1(tx_wd_time) | B0(tx_wu_time); /*  (both tx switch and rx switch together) */
                        break;
                    default:
                        temp = B3(0xFFU) | B2(0xFFU) | B1(0xFFU) | B0(0xFFU); /* default to no function in case of error */
                        lastStatus = gXcvrInvalidConfiguration_c;
                        break;
                }
                /* setup RF_STATUS pin for TSM_SPARE2 output */
                RSIM->DSM_CONTROL &= ~(RSIM_DSM_CONTROL_WIFI_COEXIST_2_MASK); /* Clear WIFI_COEXIST_2 bit to use TSM_SPARE2 on RF_STATUS pin */
                XCVR_TSM->TIMING45 = temp; /* set the timing */
                /* Enable the output drivers for RF_STATUS and RF_PRIORITY */
                RSIM->CONTROL |= RSIM_CONTROL_IPP_OBE_RF_STATUS_MASK;
            }
            if ((rf_priority_func != NO_FUNC) && (lastStatus == gXcvrSuccess_c))
            {
                switch (rf_priority_func)
                {
                    case TX_FUNC:
                        temp = B3(0xFFU) | B2(0xFFU) | B1(tx_wd_time) | B0(tx_wu_time); /*  (tx switch) */
                        break;
                    case RX_FUNC:
                        temp = B3(rx_wd_time) | B2(rx_wu_time) | B1(0xFFU) | B0(0xFFU); /*  (rx switch) */
                        break;
                    case BOTH_TX_RX_FUNC:
                        temp = B3(rx_wd_time) | B2(rx_wu_time) | B1(tx_wd_time) | B0(tx_wu_time); /*  (both tx switch and rx switch together) */
                        break;
                    default:
                        temp = B3(0xFFU) | B2(0xFFU) | B1(0xFFU) | B0(0xFFU); /* default to no function in case of error */
                        lastStatus = gXcvrInvalidConfiguration_c;
                        break;
                }
                /* setup RF_STATUS pin for TSM_SPARE3 output */
                RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_WIFI_COEXIST_3_MASK; /* Set WIFI_COEXIST_3 bit to use TSM_SPARE3 on RF_PRIORITY pin */
                XCVR_TSM->TIMING46 = temp; /* set the timing */
                /* Enable the output drivers for RF_STATUS and RF_PRIORITY */
                RSIM->CONTROL |= RSIM_CONTROL_IPP_OBE_RF_PRIORITY_MASK;
            }
        }
        else
        {
            lastStatus = gXcvrInvalidConfiguration_c;
        }
    }

    return lastStatus;
}

void XCVR_FadPaFemOnCoexIDeInit(void)
{
    RSIM->CONTROL &= ~(RSIM_CONTROL_IPP_OBE_RF_PRIORITY_MASK | RSIM_CONTROL_IPP_OBE_RF_STATUS_MASK); /* Ensure both enable bits are cleared to prevent usage. */
}

#endif /* RADIO_IS_GEN_3P0 */
#endif /* (((RADIO_IS_GEN_3P0) || (RADIO_IS_GEN_2P1)) &&  PA_FEM_SUPPORTED */

#if RADIO_IS_GEN_2P1
void XCVR_bumpPaPowerUp(void)
{
  
    uint32_t temp_trim;
    temp_trim = XCVR_ANALOG->BB_LDO_1;
    temp_trim &= ~(XCVR_ANALOG_BB_LDO_1_BB_LDO_HF_TRIM_MASK);
    temp_trim |= XCVR_ANALOG_BB_LDO_1_BB_LDO_HF_TRIM(0x5U);  /* Measured value required for high PA power output (+5dBm) */
    XCVR_ANALOG->BB_LDO_1 = temp_trim;
}

void XCVR_releasePaPowerBump(void)
{
    uint32_t temp_trim;
    temp_trim = XCVR_ANALOG->BB_LDO_1;
    temp_trim &= ~(XCVR_ANALOG_BB_LDO_1_BB_LDO_HF_TRIM_MASK);
    temp_trim |= XCVR_ANALOG_BB_LDO_1_BB_LDO_HF_TRIM(0x0U);  /* Put back the original value (bitfield default value) */
    XCVR_ANALOG->BB_LDO_1 = temp_trim;
}
#endif /* RADIO_IS_GEN_2P1 */
